/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Object Oriented Programming    :

  - برگرفته از زندگی روزمره ما هستش
   
  - چون ما انسان ها به هر طرف امون که نگاه میکنیم  اشیا می بینیم  پس انسان برا اساس اشیا فکر میکند

  - در برنامه نویسی شی گرا هم تمام تلاش این هستش که مفاهیم برنامه نویسی رو براساس همین اشیا دنیای واقعی بتونیم بیایم و مدل کنیم 

  - دلیل مدل سازی هم اینه که ذهن انسان توانایی بالایی در مدل سازی تجرید یا انتزاع دارد

  - در برنامه نویسی شی گرا ساختار یا اون بلاک اصلی برنامه های ما شی هستش

  - در برنامه نویسی شی گرا توابع و داده هامون تا حد امکان در قالبی به نام   شی میان و در کنار یکدیگر قرار میگرند و این اشیا میان و با هم ارتباط قرار میگرند  

  نکته : کلاس ها نقشه ها یا الگو هایی هستند که یک سری ویژگی  یا  صفت در  داخل  خودشون   دارند و مدل سازی می شوند  حالا این  کلاس ها میان و از روی این اشیا نمونه گیری می شوند

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

مفاهیم پایه ای شی گرایی  

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

  1- Abstraction              2- Inheritance                3- encapsulation               4- polymorphism 
  
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------











*/
