/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

1- Abstraction  :    یک سری مفاهیم رو ما داریم که خود به خود وجود ندارند اصطلاحا به صورت کلی هستند و بیشتر شبیه به طرح یا الگو هستند و قابل پیاده سازی
برای ما نیستند  یا اصطلاحا مفاهیم هستند که اون هارو به مصداقاش میشناسیم مثل کلمه حیوان که یک الگو خیلی کلی یا آجیل  که حالا عینیت  یافته های این الگوها
میشند  مثل  گربه و پسته  همچین مفهوم رو ما در داخل برنامه نویسی هم داریم کلاس هایی که صرفا میان و یک مفهوم کلی رو بیان می کنند و قابل پیاده سازی نیستند

انواع دسته بندی کلاس

Concrete Classes   :  باشند رو میگویند new  به کلاس هایی که قابل نمونه سازی با استفاده از کلمه 

Abstraction Classes   :  به کلاس هایی که قابل نمونه سازی نیستند و فقط میشه از اون ها ارث بری کرد 

ارث بری میکنیم   باید بیایم و تمامی متد هایی که در داخل این نوع از کلاس  extends  هستند با استفاده از  Abstraction  نکته : هنگامی که میایم و از کلاس هایی که به صورت 
کنیم اشون override ها پیاده سازی شده است رو در داخل کلاسی که ارث بری کرده هم دوباره  پیاده سازی شون کنیم یا اصطلاحا 

باید بیایم و در نظر بگیریم Abstraction  ویژگی های کد نویسی تمیز که در نوشتن  

--   one  interface   اگر قرار بود بیایم و استفاده بکنیم

--  ما میتونیم بیایم و از کانستراکتور ها استفاده بکنیم abstract در داخل 

--  ها استفاده بکنیم access modifires  ما میتونیم بیایم و از  abstract  در داخل 
 
--  اجزای کامل اون میتونن بیان و اصطلاحا از نوع استاتیک باشند   abstract در داخل 

ما این مفهوم به طور کلی داخل جاوااسکریپت نداریم و باید بیایم و برای استفاده از این مفهوم اصطلاحا از  تایپ اسکریپت استفاده بکنیم

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

هستند این متد ها جزئیات اون مفهوم رو میان و توضیح میدهند Abstract  میان و مفهوم رو به صورت کلی نشون میدهند و متد هایی که به صورت  Abstract   کلاس های که از نوع 
  
abstract class Person {   

    constructor( public name : string ,  public family : string  ){    this.name = name;     this.family = family;     }
         abstract sayName() : string {         return this.name + this.family     }     }

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/