/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 
2- Inheritance  :  به معنی ارث بری به این صورت که یک کلاسی می تونه ویژگی های   یک کلاس رو به ارث ببره و ویژگی های جدید رو هم در خودش داشته باشه که به کلاسی  
که ازش ارث برده میگن کلاس پرنت و به خود اون کلاس میگن چیلد ما بهتره بیایم و کلاس هایی به صورت پدر و فرزند با هم دیگه ارث بری کنیم که ویژگی های مشترک زیاد رو با  
هم  هم داشته باشند همچنین ماهیت کلاس ها در جاوااسکریپت همون اشیا هستند   

نکته : ما علاوه بر ارث بری کلاس ها میتونیم بیایم و ارث بری کلاس از تابع رو هم داشته باشیم که بهش ارث بری پویا میگویند

نکته : خوب ما گفتیم در جاوااسکریپت چیزی به اسم کلاس رو نداریم و ارث بری ها در اصل از همون اشیا هستند حال تفاوت کلاس ها با کانستراکتور فانکشن هامون در دو چیز  هست

1- for .. in  کلاس ها در پیمایش با استفاده از این حلقه دیده نمی شوند 
2- "use strict" کلاس ها در حالت سختگیرانه جاوااسکریپت میان و فعال می شوند  

در کلاس هامون دقیقا مثل توابع سازنده هستش  و در اصل حکم همون توابع سازنده برای کلاس امون رو ایجاد میکنه و اگر ما قرار بود که بیایم و یک مقداری  constructor  نکته : تابع 
در کلاس هامون به این تابع اشاره میکنه this رو به کلاس امون بدهیم  باید بیایم و در این کلاس بنوبیسم و همچنین کلمه کلیدی 
  
نکات کد نویسی تمیز در نوشتن یک کلاس

--   تمامی اجزای یک کلاس مرتبط با تنها یک فعالیت باشند
--   یک کلاس نباید خیلی طولانی  تعریف شود
--   در تعریف یک کلاس باید دید ما به صورت خیلی کلی باشد 
 
مال موقعی هستش که ما میایم و از یک  کلاس ارث بری میکنیم و نیاز به این داریم که بیایم و اون مقادیر رو به کلاس پدرش پاس بدهیم برای این منظور از این  super نکته : کلمه کلیدی 
تابع استفاده میکنیم تا پارامتر هایی که پدرش نیاز داره رو بهش پاس بدهیم

class Person {
  constructor(name, age) {   this.name = name;  this.age = age; } 
  sayName() {
    return "My name is " + this.name + " " + this.age + "  old year";  }
}

class Progrmer extends Person {
  constructor(name , age , still ) {   supe r( name, age);     this.still = still; } 
}
   
let emad = new Programer("emad",24)

اگر ما این کار رو انجام ندیم در اصل مفهوم ارث بری رو به طور کامل رعایت نکرده ایم

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/