/*
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

encapsulation : به معنی محفوظ کردن یا داخل یک محفظه قرار دادن هستش اون اطلاعات    مربوط به یک کلاس رو طوری در آن کلاس قرار می دهیم که دیگه توسط کلاس های دیگه قابل 
تغیر نیست و  یک کلاس دیگه به اون اطلاعات دسترسی نداشته باشد مثل تعریف کردن متغیر ها یا توابع در داخل کلاس هامون همچنین ما میتونیم با استفاده از کلاس فیلد ها بیایم و یک سری
متغیر پرایوت هم در داخل کلاس هامون تعریف کنیم

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

میاد و پشتیبانی میکند این الگو به تابعی میاد و گفته می شود که به محض تعریف شدن اجرا میشود IIFFE  مدل کپسوله سازی در جاوااسکریپت از الگوی  

  var data = (function({

    function save(){ alert("load")}
    function load(){ alert("load")}

    return { load:load }

  }))()

  در این حالت تابع لود  پاپلیک و تابع ذخیره به صورت خصوصی در دسترس هستش

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

استفاده از گت و ست در کلاس هامون بریا این هستش که بیایم و  کلاس امون رو امن تر کنیم  و فقط لازم هستش که قبلا نام تابع از این واژ ها استفاده بکنیم 

class Person {         constructor(name, age) {     this._name = name;      this._age = age;          }

        get fullName() {    return `i am ${this._name} `;        }

        set fullName(name) {    this._name = name;         }
        
 }     
 
let emad = new Person("emad",18)
emad.fullName = "ali"
console.log(emad.fullName)

ما می توانیم برای هر پراپرتی در کانستراکتور امون بیایم و گت و ست درست بکنیم 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/