/*
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

import css style :             1- inline              2- internal                     3- external      . , #  ,  * {}

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                
استایل دادن ها به صورت تاکیدی  h5.test1   h4.test1

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

css specity :  1- important      2-inline    3-id    4-class / seudo class  /attribute selectors   5- element seudo element

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

-seudo class : میزاره یکسری المان های منظم براساس یکسری شرط ها انتخاب بکنم

        1- hover :  all Tag        2- active : all Tag       : empty  عنصر خالی عنصری است که محتوا نداشته باشد
                                                                                 محتوا می تواند یک متن ساده و یا حداقل یک عنصر باشد
 
         3- focus  / valid  / required   : Input and form
         tabIndex  یه نام  Attribute   همانطور که در بالا گفته شد همه ی تگ ها اصطلاحا فوکوس پذیر نیستند ولی میتونیم با استفاده از        
          بیایم و این قابلیت رو بهش بدیم 
          
         <li li tabindex="1">1</li>
         <li li tabindex="0">2</li>
         <li li tabindex="2">2</li>

         1 => 2 => 0


         4- visited  / target : a

        5- frist-child || p:frist-child در هر صورت میاد و فرزند اول رو برای ما انتخاب میکند
            last-child  || p:last-child  در هر صورت میاد و فرزند آخر رو انتخاب میکند

            nth-child(5)  ||  nth-child(odd) ||  nth-child(even)  برای حرکت بین فرزندان با پیمایش
            nth-last-child

        6- frist-of-type || p:frist-of-type  با مشخص کردن نوع اش میاد اولین فرزند رو انتخاب میکند
            last-of-type || p:last-of-type    با مشخص کردن نوع اش میاد آخرین فرزند رو انتخاب میکند

            nth-of-type  || nth-last-of-type برای حرکت و پیمایش بین المان ها و دسترسی به اون

           در استفاده از دو سودو بالا اگر ما نیایم و نوع رو مشخص نکنیم از تمام تگ های فرزند اولین و آخرین رو انتخاب میکند 

        7- in-range  : input        

        8- :not()  با قرار دادن نام یک تگ میتوانیم اون رو سلب از استایل کنیم
      
        9- :onlychild

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

nav a : not (: frist-child ) { } معرفی سلکتوری که به ما میگوید به غیر از فرزند اولیه بیا و بقیه رو انتخاب کن 

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 */
