/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

در طراحی ریسپانسیو باید اولویت طراحی مون در ابتدا روی موبایل باشه و باید طوری طراحی کنیم ک هر شخصی با هر اندازه اسکرینی وارد سایت ما شد بتونه سند ببینه و سند ما اسکرول افقی اصلا
نخوره همچنین در طراحی به تین سبک هدف اصلی ما کنترل و مدیریت بهتر عرض هستش

min-width : یعنی حداقل عرض و عرض امون از این مقدار باید بیشتر باشه
max-width : حداکثر بیشترین حالت از این بیشتر نباشه و بیشتر شد دیگه اعمال نشه

مدیا کوری ها یک چیزایی شبیه شرط های برنامه نویسی هستند مثلا یک استایلی رو میدیم و بعد میگیم این استایل در این شرط بیاد و تغیر  کنه و رفتارش عوض بشه

@media not | only mediaType (example screen print reader ) and | not | only (media feature ) {  .my-code { } }

media feature : min-witdth / max-witdth / witdth / height / min-height

2- @Media only screen and ( min-witdth : 576px ) and ( max-witdth : 768px ){ } 
بین میگه اگه عرض دیوایس از 576 پیکسل به بالا بود و کمتر از 768 بود بیا و این هارو اعمال بکن

.col-1 { width: 8.33%; } .col-2 { width: 16.66%; } .col-12 { width: 100%; }

@media only screen and (max-width: 576px) {  .child1 { background-color: red;  }   }

@media only screen and (min-width: 576px) and (max-width: 768px) {
 .child1 {  background-color: rgb(0, 199, 172);  }   }

@media only screen and (min-width: 768px) and (max-width: 992px) {
 .child1 {  background-color: rgb(70, 0, 199);  }  }
 
@media only screen and (min-width: 992px) and (max-width: 1200px) {
 .child1 {  background-color: rgb(199, 186, 0);  }  }
 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

@media only screen and (max-width: 576px) {  .child1 {  background-color: red;  }  }

@media only screen and (min-width: 576px) {  .child1 {  background-color: rgb(0, 199, 172);  }  }

@media only screen and (min-width: 768px) {  .child1 {  background-color: rgb(70, 0, 199);   }

@media only screen and (min-width: 992px) {  .child1 {  background-color: rgb(199, 186, 0);  }

میتونیم برای موبایل هامون بیایم و چک بکنیم که در چه حالت هایی بیاد و باشه 

برای ساپورتonly رو قرار بدهیم کلن منظور رو میاد و عکس میکنهو مقدار not بیایم و مقدار @Media نکته : اگر ما بیایم و بلافاصله بعد از 
مدیا های قدیمی هم هستش  

min width : 576px از این جا به بعد یعنی به طول بزرگ تر 

نکات استفاده از استایل های زیر برای گرید بندی بهتر پروژه هامون

.container .row .container-fluid .container-fluid { width : 100% }

.container { clear: both; max-width:1200px; margin-left: auto; margin-right: auto; }

.row::after { content: ""; clear: both; }

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

برای گرید بندی بهتره به شیوه زیر بیایم و عمل بکنیم






----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
