/** 
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

 که بیاین و از نوشتن کد های تکراری جلوگیری کنید  ِDont Repeat YourSelf  که مخفف شده عبارت  DRY اصل

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 
css :  cascading  styles sheet
CDN : یک سری سرور هایی که برای اتصال و دانلود فایل هامون استفاده می شود
inherit : به معنی ارث بری از والدش هست   inital : به معنی اولیه هستش  که در روت تایین شده هست
نکته :   :root{   --name : value }  ...... color : var(--name)   استفاده از متغیر ها در css

 در نام گزاری ها هم سعی شود _ بگزاریم css ماژولار کردن فایل ها 
@import  دو تا مفهوم 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

CDN fontawesome

<link
rel="stylesheet"
href="https://pro.fontawesome.com/releases/v5.10.0/css/all.css"
integrity="sha384-AYmEC3Yw5cVb3ZcuHtOA93w35dYTsvhLPVnYs9eStHfGJvOvKxVfELGroGkvsg+p"
crossorigin="anonymous"
/>

اون رو قرار بدهیم و همچنین پوشه ی all.css  امون کافی هستش که بیایم و فقط فایل   css ما میتونیم بیایم و کل اون رو دانلود کنیم که برای استفاده از اون در داخل فایل های  CDN به غیر از استفاده از 
اش رو بیایم و در فایل هامون قرار بدهیم webFonts 

fas  fa-nameFontAwsome 

CDN Bootstrap

<link href="//netdna.bootstrapcdn.com/bootstrap/3.0.0/css/bootstrap.min.css" rel="stylesheet">

روی عنصر انجام نشود  !important  برای تاکید بر استایل مربوطه که دیگه ترجیحای  ترتیبی و مدل های دیگه

Units :  انواع مقدار دهی های عناصر

% :  parent size  برحسب والدش میاد و درصد رو اعمال میکنه مثلا برای ارتفاع اگر مقدار باشه میاد و  همون قدر درصد رو اعمال میکند
بزاریم میاد و به فرزند اون نگاه میکنه  auto ولی اگر مقدار ارتفاع رو 

px :    absolute size سایز مطلق 
vh  :   entire view height   port  بر اساس تقسیم بندی 
vw :   entire view width port

em : font size of  element  بر اساس والدش که هر چه قدر میاد و میگیرد اگر خود المان امون بیاد بگیرد اون رو تغیر  میده و اگر نداشته باشه به فونت بالا سری میاد و نگاه میکنه

rem :  font size of  root element 

rem یک تکنیک برای تبدیل های بهتر و استفاده ی بیشتر از واحد 

16px = 100%  10px = x = 62.5%     html {   font-size : 62,5%    }  35px  :  3.5rem  //  3px    :  .3rem

ها استفاده بکنیم  به خاطر این که در داخل مرورگر های کروم و فایرفاکس با دادن این نوع داده ای  em ما برای نوشتن مدیا کوری ها باید بیایم و از 
استفاده نکنیم چون در سافاری در مرورگر های اپل rem ما نگاه نمیکنه و به تنظیمات پیش فرض خود مرورگر میاد و نگاه میکنه حالا چرا  html نمیاد به 
استفاده بکنیم em  or  px  به روت نگاه میکنهو باید از 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

بعد طول عرض المان و بعد فونت هامون  display بعد position نکته : برای استایل دهی می تونیم به شیوه زیر عمل بکنیم که برای مثال  بیایم و اول استایل های 
و بعد از اون  بوردر هامون و بعد رنگ ها  و بعد انیمشن ها و بعد بقیه مسائل می نویسیم 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

وقتی میایم و برای اون  اچ رف قرار نمیدیم حالت لینک داره  ولی لینک نمیشه یعنی اون حالت کرسر بودن و نشانه گر بودن  رو داره ولی لینک به جایی نمیشه a نکته :   ما هنگام کار با تگ 
prent Default که برای درست کردن چنین شرایط در  جی کوری باید قبلش میامدیم و 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 */
