/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
=============================================================================================================================================

what is  Git  : دو تا تعریف مهم برای استفاده از گیت رو ما داریم

     1 -  SCM :  Source Control Management  میتونه بیاد و سورس کد های ما رو مدیریت بکنه
     2 -  VCS :  Version Control System   میتوه بیاد و ورژن ها یا تاریخچه مختلف برنامه ما رو مدیریت بکنه

Git Helps  :در چه مواقعی این گیت میتونه بیاد و مشکلات مارو حل بکنه 

1 - repositories
Git Helps us to create repositories  میتونه بیاد و برای ما یک مخزن کد درست بکنه و ما دو مدل مخزن داریم اولی مخزن لوکال که رو سیستم امون دومی هم مخزن ریموت مثل گیت هاب

2-  versions 
Git stores different versions of source  میتونه بیاد و برای ما ورژن های مختلفی از برنامه امون رو نگه داره

3- comparition  (تلفظ  kamparizon )
Git enable comparition of diffrent versions  of same source   میتونه بیاد و ورژن های مختلفی از برنامه مارو باهم مقایسه بکنه

4- collaboration (تلفظ  kolrabition )
Git promotes collaboration among developers میتونه بیاد و اجازه بده که برنامه نویسی های مختلفی روی این پروژه کار کنند

ها هستش snapShot چیزی که گیت نگه داری میکنه 

فراخوانی می شود برای همین امکان ندارد که در حین انتقال بدون اینکه گیت متوجه شود فایلی از دست برود checkSum می شود و با همان checkSum همه چیز در گیت  

=============================================================================================================================================

git   --version                //                git --help                //           git  init  :   create   folder  .git  

git init                           //                git add .                 //           git commit -m ""   

git commit -am     "index.html modified with booking right now text "   میتونیم بیایم و از دستور commit  کنیم و هم  add  اگر ما یک موقع لازم داشتیم که هم بیایم و 

command Windows :   cd      cd ..   ls    clear  //  code .   ( open VS code )   //   mkdir (  create new directory  )   //    pwd ( میتونیم ببنیم دقیقا در چه جایی هستیم)

touch  namefile  ( برای ما میاد و یک فایل رو ایجاد میکنه )  nano  namefile    ( میتونیم بیایم و به فایل امون دسترسی داشته باشیم و تغیرات ایجاد کنیم روش )

جایی که ازش مخزن گرفتیم Origin یعنی آخرین کامیتی که بودیم رو مشخص میکنه و  HEAD  نکته : کلمات کلیدی 

=============================================================================================================================================
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
