/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
=============================================================================================================================================

ما به طور کلی داخل گیت دو تا وضعیت کلی کدهامون رو داریم

1- Un Tracked    color  red :   next level    :   git add .  
   رو به مخزن امون اضافه میکنیم Un Tracked اگر فایلی که ما به مخزن امون اضافه میکنیم از قبل توی اون نباشه داریم میایم و یک فایل

2- Tracked  : یعنی به فایل گیت ما اضافه شدن و گیت میتونه به تغیرات این فایل ها نظارت داشته باشه و سه تا حالت میتونه بگیره 

                    -  stage :  وارد این مرحله می شوند  git add فایل هایی که میان و داخل این وضعیت اضافه می شوند و با استفاده از دستور
                    -  modified : color  red  بودند ولی خوب یکسری تغیرات کردند و به این جا اضافه شدند  stage فایل هایی هستند که قبلا در مرحله 
                    -  unmodified :  به گیت ما اضافه شدند و یا به قولی ادد شده اند اما تغیر دیگه ای روشون اعمال نشده و صرفا منتظر کامیت کردن هستند


git  status  life cycle  :    با استفاده از این دستور میتونیم بیایم و وضعیت فایل ها و کدهامون رو مشاهده بکنیم

                   - working Directory در ابتدا هر کدی بزنیم وارد این مرحله می شویم
                   - stageing Area  با ادد کردن کدهامون به این مرحله میرسیم
                   - repository   با کامیت کردن وار این مرحله می شویم

git status -s   میاد و یک حالت خلاصه طور به ما نشون میدهد
               
=============================================================================================================================================

Config Git  :   git config --global  user.name " "   /    git config --global  user.email " "
برای اینکه بیایم و تغیرات امون رو به سمت ریپازیتوری امون بفرستیم باید بیایم و از این نوع دستورات اصطلاحا استفاده بکنیم

=============================================================================================================================================
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
