/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
=============================================================================================================================================

نکته : ما اگر بیایم و یک فایل که در وضعیت های مختلف هستش و اون فایل امون رو بیایم و به مراحل قبلی برش گردونیم  میتونیم بیایم و از این دستور استفاده بکنیم و تمام تغیرات ما رو میاد و برامون  
میکند undo اصطلاحا

git  restore  nameFile  //  git restore  --staged  nameFile  :  اگر بخایم بیایم و در داخل یک پروژه که بهش گیت اضافه شده و یک سری کامیت هم داریم تغیرات امون رو به مرحله قبلی شون بر
گردونیم میتونیم از این دستور استفاده بکنیم و اصطلاحا تمام تغیرات مارو undo میکنه البته فقط روی فایل هایی اعمال میشه که به صورت ترک هستند نه اون هایی که انترک هستند و گیت هیچ دسترس
بهشون نداره

=============================================================================================================================================

          --  git reset  --soft  id-commit  نگه میداردstage این دستور کامیت های قبلی رو در مرحله ی 
          --  git reset  --mixed  id-commit میکند working Directory میکند و وارد مرحله ی  unStage  این دستور به صورت پیش فرض تغیرات را
          --  git reset  --hard  id-commit  امان stage مارا مستقیما به اون کامیت امان بر میگرداند و نه در داخل دایرکتوری و نه داخل

=============================================================================================================================================

git cherry-pick id : عملا میایم و اون کامیت رو از اونجا بر میداریم و قرارش میدهیم روی هد امون و بعد تغیرات امون رو از انجا میکنیم  این عملیات برای موقعی هستش که بخایم بدون در خونریزی از یک 
کامیت به یک کامیت دیگه بریم و حافظه ی کامیت هامون پاک نشه

که معمولا بعد از انجام این مرحله یک کانفلیکت رو به همراه داریم که باید مجدد یک کامیت رو بزنیم

=============================================================================================================================================

 git  commit    --amend    --message= " message "  تغیر دادن پیغامی که برای کامیت قبلی مون ست کردیم

git  commit     --amend     --no-edit  پیغام اضافه نشه ولی این تغیرات امون بیاد و به اون کامیت اضافه بشه

=============================================================================================================================================
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 */
