/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
=============================================================================================================================================

git log      //       git log --oneline      //      git       log     --oneline     --graph  --all  //     git      log --oneline       --decorate     --graph     --all

git log  --oneline -n 5   یعنی بیا و 5 تا کامیت آخر من رو بهم نشون بده 

=============================================================================================================================================
   
git diff :  با استفاده از این دستور میتونیم بیایم و تفاوت و تغیرات بین دو تا شاخه رو مشاهده بکنیم که برای این کار اول نام شاخه ای که توش هستیم و بعد هم نام شاخه ای که میخایم مقایسه انجام
امون Head بشه رو میزنیم و به صورت پیش فرض میاد و با آخرین کامیت امون این مقایسه رو انجام میدهد یا اصطلاحا 

git diff   == git diff HEAD   هیچ تفاوتی باهم ندارند

git diff  HEAD^^  استفاده میکنیم و حالا با دو تا فایل قبلی   git diff  HEAD^   اگر خواستیم که این مقایسه بیاد و با یک فایل قبلی یا کامیت قبلی مقایسه بشه از دستور

git diff  develop  merge

اون هایی که با    ----    نشون میده یعنی تغیراتی که از قبل داشتیم و اون هایی که با    +++    نوشته یعنی تغیراتی که جدیدا اومدیم و ایجادش کردیم

=============================================================================================================================================

git reflog  :  میاد و کلیه تغیرات امون رو بهمون نشون میده که کجاها رفته و چه کامیت هایی زده و کلیه تغیرات امون کلیه جزعیات که در داخل مخزن افتاده رو نشون میدهد و اگر جزعیات رو خواستی
هم ازش استفاده میکنیم

=============================================================================================================================================

git blame  nameFile   با استفاده از این دستور میتونیم بیایم و ببینیم که چه کسی در چه زمانی چه تغیراتی رو اعمال کرده

=============================================================================================================================================
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 */
