/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
=============================================================================================================================================

GitHub :   گیت اومده  و نوشته شده  platform  یک سرویس که روی یک ابر نوشته و به ما اجازه که مخزن هامون رو مدیریت کنیم و یکسری امکانات رو به ما میدهد و یک سیتسم که روی   

برای اضافه کردن پروژه امون به آدرس یا ریپازیتوری گیت هامون میایم و اول طبق دستورات زیر  عمل میکنیم

git   remote   add   origin   Http or ssh address respository           //             git  push   -u  origin   master  

git  pull  گرفتن تغیرات  از ریپازیتوری سیستم
رو نشون میده و بعد از اون هم کامیت ها و  origin / master ما وقتی میایم و کدهامون رو میفرستیم روی  سرور از اون کامیتی که کدهامون ارسال شده برامون یک لاگ 
تغیراتی هستش که انجام دادیم ولی ارسالشون به سمت سرور نکردیم و هنگامی که میایم و مجدد کدهامون رو می فرستیم به سمت سرور با پیام زیر در هنگام استفاده از 
Your branch is up to date with 'origin/master'.   مواجه می شویم git status 

خودش یکسری تغیرات روی یک فایلی رو ایجاد بکنیم باید بیایم و اون تغیرات رو حتما حتما کامیت اشون بکنیم و به عنوان یک edditor نکته : ما در داخل گیت هاب اگر بیایم و با استفاده از
کامیت اون رو در داخل سیستم امون ثبت اش بکنیم

رو انجام بدهیم دلیل این کار هم این هستش که باید تغیرات اون رو داشته باشیم تا بتونیم pull رو انجام بدهیم باید بیایم و یک بار عملیات  push نکته : ما قبل از اینکه بیایم و عملیات اصطلاحا  
بهش یک تغیر رو اضافه بکنیم

git  clone   HTTPS  / SSH   اگر ما نیاز داشتیم که بیایم و مخزن کدهامون رو از داخل گیت هابمون بیاریم و داخل  سیستم لوکالمون و ازش استفاده بکنیم از دستور زیرا استفاده میکنیم

برام کلون بگیر و بریز تو branch اضافه داخل مخزن ریموت امون داشتیم که به همشون نیازی نداریم میتونیم بیایم و مشخص کنیم که بیا م و فقط فلان  branch  حالا اگر مثلا ما یکسری 
مخزن لوکال ام برای این کار از دستور زیر استفاده میکنیم و حتی با دستور پایینی اشم میتونیم عمق اون کار رو مشخص بکنیم

git clone --branch==master          //       git clone --branch==master  --depth (0,1,....)(URL)

=============================================================================================================================================
 
استفاده  SSH  راحت هستش که زیاد امن نیستش و بهتر هستش که از  HTTPS  که روش استفاده از   HTTPS  / SSH    خوب همین طور که در بالا گفته شد ما دو مدل کلون کردن داریم 
بسازیم SSH   بکنیم برای این راه حل هم بهتر  بیایم و یک کلید

ssh  :  میتونیم ببینیم که ایا داریم یا خیر

ssh-keygen  رو نشون میده و وارد این آدرس میشیم puplic key  میاد و برامون یک کلید میسازه  وقتی میایم و یک کلید میسازیم به ما یک آدرس 
می شیم و بعد دو تا فایل میبینیم  cd   /c/Users/emad/.ssh  وارد مرحله 

id_rse : کلید که تحت هیچ شرایطی رو نباید به کسی بدیم چون باهاش رمز میکنیم    //      id_rsa.pub  :  کلیدی هستش که باید به گیت هاب بدیم
میایم و کپی میکنیم و بعد در گیت هاب مینویسیم     cat     id_rsa.pub   داخل فایل  
ssh-agent -s    //    eval $(ssh-agent -s )   // ssh-add  id_rsa و برای این که سیستم امون هم این کلید رو بشناسه میایم و دستورات زیر به ترتیب  مینویسیم

و یک کلید جدید میسازیم  SSH and GPG keys  خوب در داخل آدرس گیت هابمون وارد قسمت تنظیمات می شویم و بعد وارد مرحله
و کلیدی که داخل سیستم امون ساختیم و بهش سناسوندیم رو بهش اضافه میکنیم

=============================================================================================================================================

نکته : نوشتن کامیت در بالا بردن کامیونتی  که داریم از اون مخزن استفاده میکنیم بسیار مهمه و باعث میشه خوانایی برنامه ما به شدت بره بالا برای نوشتن یک کامیت خوب یکسری قوانین رو باید رعایت کنیم

1 -  اومدیم و فیکس کردیم  Bug  در ارتباط با هدف کلی که این کامیت تغیر دادیم مینویسیم  برای مثال یک 
2-   جایی که تغیر داده ایم را مشخص میکنیم که معمولا اسم فایل را مینویسیم
3-  در نهایت هم میایم و یک توضیح مختصری که دقیقا چکار کردیم رو مینویسیم

#1  نکته : اگر ما اومدیم و یک فیچر  درست کردیم خودمون بهتر هستش که بیایم و با استفاده از 
باشه اگر ما در داخل پروژه امون اومدیم و به یک کانفلیکت خوردیم بهتر هستش که برای حل اش بیایم و به صورت implement # 2  اون هارو نامگزاری کنیم و وقتی به وجود اوریدیم اولین کامیت امون 
solve config useing mine or theirs  زیر کامنت بگزاریم 

Task by issues :             خوب ما در داخل خود اکانت گیت هاب امون میتونیم بیایم و با استفاده از این قابلیت یکسری تسک رو برای خودمون و یا هم تیمی هامون ایجاد بکنیم برای این کار
Assigment ها مراجعه میکنیم و نوع اون تسکی که نوشتیم رو مشخص میکنیم برای مثال یک باگ و بعد درر قسمت  label  بعد از مراجعه به این قسمت و نوشتن متن تسک میایم و به قسمت 
آیدی کسی که باید بیاد و این خطا رو فیکس کنه رو هم مشخص میکنیم

خاصی استفاده styleing message  خوب حالا وقتی که میخایم کامیت انجام دادیم بیایم و همزمان اون تسکی که به روش بالا برای خودمون ایجاد کردیم رو هم ببندیم باید هم زمان بیایم و از یک  
بکنیم و اون استایل به شیوه زیر هستش و یکی از اصطلاحات زیر رو به کار ببریم این اصطلاحات رو آخر متن پیاممون برای کامیت بیایم و استفاده بکنیم

fixe        #xx        issues شماره      //      fixes          #xx        issues شماره        //         fixed          #xx        issues شماره 

close      #xxx       issues شماره     //     closes      #xxx       issues شماره         //       closed       #xxx       issues شماره 

resolve    #xxx       issues شماره     //    resolves   #xxx       issues شماره      //   resolved    #xxx       issues شماره 

کنیم push  حالا وقتی بیایم و این کار رو انجام بدیم میاد و  داخل گیت هام اون تسک امون رو حل شده میدونه و  فقط لازم هستش که بیایم و کدهامون رو به سمت سرور 

=============================================================================================================================================  

Milestones : ما  با استفاده از گیت هاب میتونیم همچین چیزی رو تعریف کنیم که به ما میاد و یک هدف میده که مثلا در آینده باید بیایم و چه کار هایی رو انجام بدهیم و یک تاریخ رو براش
رو هم به اون ها مرتبت اش کنیم issues مشخص میکنیم و میگیم در این تاریخ میخایم به همچین جایی برسیم و حتی میتونیم بیایم و چند تا 

=============================================================================================================================================

Import Project  میتونیم بیایم و مخزنی که مثلا تو گیت هاب هستش رو بیاریم و روی گیت لب ادامه بدیم

=============================================================================================================================================

استفاده نکنیم -f  در داخل گیت بهتر هستش از دستورای اجبار استفاده نکنیم
چون در داخل گیت ما یک تعداد همگروهی داریم و هر کدوم امون داریم روی یک برنچی کار میکنیم و هر برنچی که میسازیم یک شاخه تو درخت گراف امون ساخته میشه
استفاده میکنیم باعث میشه این شاخه ها و گراف ها از بین برن واسه کد ما شاید تاثیری نداشته باشه ولی برای کسایی که استفادهforce وقتی ما از دستورای مثل 
میکنند باعث میشه برنچ ها و تاریخچه هامون از بین بره

برای همین از دستوراتی مثل

-force    git rebase  باید خیلی با احتیاط استفاده بکنیم


=============================================================================================================================================

issuo 

*  [ ]   :   های مختلف ایششو که زدیم رو قرار بدیم url  بیایم  و اون





=============================================================================================================================================
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
