/*
=============================================================================================================================================

git tag      -a  <tag name >     -m  <message>  و میاد و به آخرین کامیت امون اضافه میشه

git   tag  --delete    <tag name >     //      git    tag     -d      <tag name >     میاد و تگ امون رو در مخزن لوکال برای ما حذف میکنه  

git     push     origin       <tag name >     خوب ما برای ارسال تگ هامون به مخزن ریموت امون میتونیم بیایم و از به شیوه زیر عمل بکنیم

=============================================================================================================================================

git  rm --cached nameFile

git  rm -f  nameFIle   برای پاک کردن یک فایل میایم و از این دستور استفاده میکنیم

=============================================================================================================================================
*/
