/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
=============================================================================================================================================

خوب فرض کنید دو تا برنامه نویسی هستیم داریم هر کدوم روی یک شاخه ای کار میکنیم و بعد از اتمام میخایم بیایم و اون رو با شاخه مستر امون مرج بکنیم حالا وقتی یک نفر
بیاد و زود تر این کار رو بکنه اون نفر دیگه میاد و به مشکل میخوره چرا چون موقعی که اومده و یک برنچ یا شاخه از شاخه مستر گرفته تا اون جا تغیرات این برنچ داشته ولی الان 
کنه و وقتی این کار رو انجام بده تمام تغیرات مستر میاد و قبل از هد اون قرار میگیره و اون میتونه   rebase  این شاخه مبدا هاشون باهم دیگه یکی نیست و اصطلاحا باید بیاد و 
بیاد و الان مرج رو انجام بده 

git rebase    <NewBaseName>       //         git rebase msater

=============================================================================================================================================

git  revert  :  

300 redirect

200 success

100  info

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
