/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

appendChild : در انتهای عناصر انتخاب شده ، محتوای مورد نظر را وارد می کند

prependChild  : در ابتدای عناصر انتخاب شده ، محتوای مورد نظر را انتخاب می کند

before : محتوا را قبل از عناصر انتخاب شده درج می کند

after : بعد از عناصر انتخاب شده محتوا را وارد می کند

createElement : میاد و برامون یک المنت رو به وجود میاره

createTextNode : میاد و برامون یک نود که به صورت متنی هستش رو به وجود میاره

// HTML 

<ul id="myList">
            <li>Coffee</li>
            <li>Tea</li>
 </ul>
<p>Click the button to append an item to the end of the list.</p>
 <button onclick="myFunction()">Try it</button>

//JS

function myFunction ( ) {
   var node = document.createElement("LI");
   var textnode = document.createTextNode("Water");
   node.appendChild(textnode);
   document.getElementById("myList").appendChild(node);    }

برای استفاده و کار کردن با ویژگی ها یا پراپرتی ها

element.hasAttribute( name )  //   element.getAttribute( name )   // element.setAttribute( name,value )  //  element.removeAtribute( name )    

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

textContent فقط میاد و محتوا رو به ما نشون میدهد بدون هیچ تگی و نوشتن محتوا با استفاده از آن امن تر هستش و محتوای متنی معمولی فقط به ما میدهد

innerText: این ویژگی هم دقیقا شبیه به بالایی میاد و عمل میکنه

innerHtml : باعث ایجاد ری رندر در صفحه میشه و محتوای قبلی رو به صورت کلی حذف و بعد جایگزین میکند همچنین  این خصوصیت میاد و متن رو به همراه فضای خای و 
اش بر میگردونه html اون تگ ها 

innerContent :بر میگردونه HTML متن رو به همراه فضای خالی اش و بدون تگ های 

document.addEventListener('DOMContentLoaded',( )=> {  })   برای اولین بار اومد و لوود شد بیا و خط کد زیر رو برامون اجرا بکن DOM  نکته : این خط کد به ما میگه که اگر 

که میره و بین والد ها اون نزدیک ترین رو برای ما میاد و به نمایش میگزارد   closest() نکته : معرفی تابع 
console.log(event.target.closest('.collapse))

نکته : برای سرچ کردن در داخل یک فیلد سبد خرید یا سرچ امون میتونیم بیایم و  از دو  نوع اصطلاحا رخداد استفاده بکنیم 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/