/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

BOM  Borwser Object Model

نشون میدهدند مثل screen navigator  در واقع اشیایی هستند که رفتار های زمنیه ای صفحه رو به ما 

DOM Navigation

Window.open / Window.focus / Window.close / Window.screen / window.location

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

window.location.hash : صفحه بوک مارک یا مقدار هش مربوط به آن را تحویل میدهد
window.location.host : نام سرور همراه با شماره پورت رو تحویل میدهد
window.location.href برگرداندن لینک کامل صفحه ی وبمون که شبیه به   داکیومنت . یوآرال کار میکند 
window.location.hostname : دامین سایت بهمون میدهد  همون نام سرورو بدون شماره پورت 
window.location.pathname : دادن آدرس یوارال داخلی صفحه امان را میدهد
window.location.protocol : نوع پروتوکل مورد استفادهی مارو میدهد 
window.location.assign("adress web") : مسیر فعلی صفحه رو تغیر می دهد  و بلافاصله صفحه رو مجدد بارگزاری میکند
window.location.history("adress web") :
window.location.reload("adress web") : برای بارگزاری مجدد صفحه از این استفاده میکنیم 
ّدقیقا مانند متد قبلی عمل می کند با این تفاوت که آدرس سایت در هیستوری ذخیره نمی شود  
window.history.back
window.history.forward
window.navigator به ما اطلاعاتای پیرامون خود مرورگر بهمون میدهد
event.preventDefault() برای جلوگیری از رفتار پیش فرض
window.onbeforeunload  قبل از بسته شدن سایت توسط مرورگر یک کاری رو انجام بدین

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
