/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
==============================================================================================================================================

TypeScript  :  میگویند  transPiler  یک زبان برنامه نویسی هستش که میاد و کامپایل میشه به زبان جاوااسکریپت و اصطلاحا به اون یک زبان از نوع 

transPiler :  نرم افزای هستش که یک زبان  برنامه نویسی رو به یک زبان برنامه نویسی دیگه  تبدیل میکنه و میاد و کدها رو قبل از اینکه اجرا کنه و یا  تبدیل بکنه  بررسی میکنه  و اگر کد ما ایراد داشت  تبدیل
رو انجام نمیده و  این کار باعث میشه که  کدهای کامپایل شده ما همیشه بدون خطا باشند و ما مجبوریم که  کدهای بدون باگ دستوری رو ایجاد بکنیم

هدف استفاده از تایپ اسکریپت اینه بگه از چه نوع دیتایی باید استفاده بکنه برای مثال وقتی میخایم بیایم و از یک تابع استفاده بکنیم این تابع چه نوع مقادیری و از چه نوعی رو میاد و میگره و بعد اون تابع چیو
هامون هستش که اون دیتایی که قراره برای ما بیاد که بهش میگن اسکیما که اون رو تعریف میکنیم و دیتایی که میاد و میگیرم  API Call  باید بیاد و برگشت بده و یک جای دیگه که خیلی به درد میخوره در مبحث 
و در کامپوننت هامون استفاده میکنیم و هدف اینه که خیلی ریز بیایم و به پروژه امون نگاه بکنیم

==============================================================================================================================================

روش نصب تایپ اسکریپت

npm install -g typescript    //   versions   typescript@3.5.3   //  order = tsc  / tsc script.ts  بعد از نصب هم به این شیوه استفاده میکنیم 

میسازه که یک کانفیگ برامون هستش   tsconfig.json استفاده میکنیم  که میاد و برای ما یک فایل به نام  tsc --ini  برای مدیریت بهتر رو کد های تایپ اسکریپت امون برای کانفیگ بهتر اون ها از دستور

"outDir": "./",  "rootDir": "./",  :  کدهامون رو درکجا بیا و قرارشون بده و فایل هامون در کجا  رو برای ما میسازده در  این فایل کانفیگ هستند

includes : میایم و مشخص میکنیم که در داخل روت امون بیاید و چه فایل هایی رو برای ما در نظر بگیر و ترجمه کن 

exclude : node_modules میتونیم بیایم و مشخص بکنیم که چه چیزها و دایرکتوری  هایی رو برامون کامپایل نکنه مثل 

==============================================================================================================================================

npm  r -g namePackage  نکته : برای پاک کردن یک پکیج به صورت گلوبال کافی هستش که از دستورات زیر استفاده بکنیم

dev  استفاده  بکنیم و بعد ازنصب پکیج تایپ اسکریپت در npm init  ما میتوتیم بیایم و تایپ اسکریپت رو به صورت پکیج محور  فقط برای پروژه امون هم استفاده کنیم به این صورت که   در ابتدا باید بیایم و از 
اون در دستورات اسکریپت رو بیایم و اجراشون کنیم ما در داخل کدهای فایل پکیج tsc استفاده کنیم در نهایت هم با استفاده از تعریف کردن  اگر بخایم بیایم و حالت مربوط به وااچ کردن کاربرمون رو درنظر بگیریم 
اسکریپ اش  "watch" : "tsc -w" جی سون امون کافی هستشکه بیایم و بنویسیم درقسمت

yarn add typeScript  معرفی سایت با کانفیگ های مربوط با جاوااسکریپت config.coach برای بهتر کارکردن

==============================================================================================================================================

اگر نیاز داشتیم که بیایم و به پروژه ری اکتی امون تایپ اسکیرپت رو اضافه کنیم از دستور زیر استفاده میکنیم

npm install --save typescript @types/node @types/react @types/react-dom @types/jest

==============================================================================================================================================
 */
