/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

ESLint :  ما با استفاده از این کتابخونه میتونیم بیایم و بقیه برنامه نویس هارو مقید کنیم که بیان و از یکسری اصول و قوانین در هنگام کد زدن پیروی کنن و از مسیر خارج نشن که 
میگویند Linting به این کار اصطلاحا 

npm    i         -g        eslint  با این دستور میایم و اون رو نصب میکنیم
eslint    - - version  میتونیم بیایم و ورژن کتابخونه امون رو ببینیم
eslint - -init    میایم  و  اون رو به پروژه  امون اضافه میکنیم و یکسری سوالا ازمون میکنه که اون هارو جوا میدهیم

میتونیم بیایم و از یک پلاگین ادیتور هم با این نام نصب بکنیم

Ctrl + shift + p  //   Eslint Fix all  auto-fixable problem   // :  ctrl + E

میتونیم بیام و ببنیم  ESLint  خوب از جمله خطاهایی که با استفاده از 

1 - destructuring for props
2- ;
3- alt  
4-  import {Rract,useState }  from "react"   اول خط کدامون باید باشه 

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.editorconfig  که میاد و برای ما یکسری تنظیمات پیش فرض برای برنامه امون رو میتونیم توی اون قرار بدهیم بهتره بیایم و داخل سایت اش ببنیم و پلاگین مربوط به ادیتور اون 
رو هم بیایم و نصب اش بکنیمو یا میتونیم با استفاده از سرچ کردن بیایم و بهترین مدل برای کانفیگ اون رو هم پیدا بکنیم و داخل پروژه امون استفاده بکنیم

gist بخشی از گیت هاب هستش که تنظیمات رو به صورت نود در اونجا قرار میدهند

react gist  editorconfig

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

prettier : styleing formatter  اصطلاحا بهش میگن

npm  install  --save-dev  --save-exact  prettier   برای نصب اون

رو میایم و مینوسیم  .prettierrc.yml  اون سرچ میکنیم و برامون میاره و باید بیایم و یک فایل با نام configuration File  داخل داکیومنت اصلی اون میایم و پیرامون 
که باید بیایم و دوتا پلاگین رو نصب ESLint داریم رو هم از بین ببریم کافی هستش که در داک خودش جستجو کنیم   ESLint  و برای اینکه بیایم و اون کانفلیک هاییکه با 
بکنیم که اولی 

npm install --save-dev eslint-config-prettier              //          npm install --save-dev eslint-plugin-prettier

امون معرفی بکنیم  ESLint  که حالا بعد از نصب فقط کافیه اون هارو به عنوان پلاگین به 

{
    "extends" :  [ " plugin:prettier/recommended"]
}

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
config Code
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

.vscode        .settings.json
 
{
  "editor.codeActionsOnSave": {
    "source.fixAll": true,
    "source.fixAll.eslint": false
  },

  "editor.formatOnSave": true
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

 .prettierrc.yml

{ 'trailingComma': 'es5', 'tabWidth': 2, 'semi': false, 'singleQuote': true }

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

.eslintrc.json

{
  "env": {
    "browser": true,
    "es2021": true
  },
  "extends": ["plugin:react/recommended", "airbnb"],
  "parserOptions": {
    "ecmaFeatures": {
      "jsx": true
    },
    "ecmaVersion": "latest",
    "sourceType": "module"
  },
  "plugins": [
    "plugin:react/recommended",
    "airbnb",
    " plugin:prettier/recommended"
  ],
  "rules": {
    "linebreak-style": 0
  }
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

.editorconfig

# EditorConfig is awesome: https://EditorConfig.org

[*]
end_of_line = lf
insert_final_newline = true
charset = utf-8
indent_style = space
indent_size = 2

---------------------------------------------------------------------------------------------------------- --------------------------------------------------------------------------------------------------------------------------------------------

*/
