/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

در فانکشنال کامپوننت ها  ترتیب اجرا به این صورت هستش که در ابتدا کامپوننت ما میاد و رندر میشه و بعد از اون ترتیب زیر اجرا می شود

1- render           2- useLayoutEffect           3- useEffect

مورد های بالا شدیدا به هم دیگه شبیه هستند و تفاوت اون ها در دو چیز هستش دقت کن به اون مثال شمارنده که زده شد

1- ترتیب اجرای اون ها 

2-  هستش و عملیات هایی که زمان بر هستند رو اگر انجام بده میاد و صفحه رو قفل میکنه و باعث افت پرفورمنس و عملکرد صفحه امون می شود  sync به صورت 

ما کامل اومده و آپدیت شده  و بروزر امون به آخرین DOM  اتفاق میوفته کاربر اون خروجی نهایی رو میتونه بیاد و مشاهده بکنه  یعنی اون useEffect   نکته : زمانی که 
امون تزریق نشده و کاربرمون اون مقادیر نهایی رو هنوز نمیتونه بیاد  DOM  با اینکه رندر انجام شده ولی هنوز چیزی به   useLayoutEffect  مقادیر امون دسترسی داره  ولی در داخل 
رو تغیر بدیم و کاربر نمیخایم بیاد و اون حالت قبلی رو ببینه  و کاربرد بعدی میتونیم بیایم و یکسری مقادیر رو اندازه گیری بکنیم DOM  و ببینه و کاربرد اون زمانی هستش که میخایم بیایم و 
فعلی امون و کار هایی که نیاز هستش کاربر قبل دیدن خروجی نهایی بیاد و از اون استفاده بکنه scroll مثل موقعیت 

export default function Form ( ) {

    const [ counter , setCounter ] = useState(0)

    useEffect(()=> {  console.log(' use Effcet ')   }, [ ] )
    useLayoutEffect(()=> { setCounter( c=> c+1 )   console.log(' use Effcet ')   }, [ ] )
    console.log('render')  

    return(  <div  className = "container ">  <p> Counter  is : { counter }  </p>  )   
  
    ) }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
