/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================

Semantic Element : low  seo 

1- section :استفاده بکنیم در داخل این تگ میتونیم h1 .. h6  تگ هایی هستند که معمولا یک سری محتواهای معناهایی رو دارند و  عموما دارای یکسری عنوان هستند که بهتر هستش برای عناوینشون از تگ های 
استفاده بکنیم  section / nav / aside / article  از تگ های سمانتیک

نکته : در مواقعی که ما میخاهیم که بیایم یک تگ به عنوان نگه دارند تگ های دیگر و یا برای قالب بندی و یا برای نوشتن اسکریپت استفاده شود بهتر است که از تگ های سکشن استفاده نکنیم و به جای آن از تگ  
استفاده بکنیم div های

====================================================================================================================================================

2- header  : از این تگ میتونیم بیایم و برای ورودی عناوین یا تیتر های اصلی وب سایت هامون استفاده بکنیم و صرفا مختص به یک تیتر نیست هر مقاله ای در سایت های خبری تیتر هاش میتونه از این نوع باشه
استفاده بکنیم و اطلاعاتی مثل لوگو یا اطلاعات سایت رو هم در اون قرار بدیم h1 .. h6  همچنین در داخل این تگ میتونیم بیایم و از یک یا چند عنوان
<section>  <header>  <h1>Application</h1>  <h2>Paid iphone apps</h2>   </header>   <ul>  <li>Education</li>  <li>Entertainment</li>  </ul>       </section>
         
 هم استفاده بکنیم    nav در داخل این تگ ما میتونیم بیایم و از تگ 

نمونه برای استفاده در مقالات

<article>

 <header>  <h1>Military Offers Assurances to Egypt and Neighbors</h1> Published : <time datetime="2011-02-13" pubdate>February 13 2011</time>)  </header>

 <p>  CAIRO - As a new era dawned in Egypt on Saturday,  the army leadership sought to reassure Egyptians and  </p>

</article>

====================================================================================================================================================

3- footer : به پاورقی های متن ما میاد و اشاره میکنه و میتونه به طور کلی فوتر میتونه شامل اطلاعاتی در مورد یک بخش باشه مثل نویسنده متن لینک های مربوطه کپی رایت اطلاعات تماس نقشه سایت دکمه بازگشت به بالا
و غیره باشد

<article>    <h1>My Favorite Trains</h1>  <p>I love my trains. My favorite train of all time is a Kof.</p>

 <footer>  <!-- footer for article -->  <p>Published <time pubdate datetime="2009-09-15T14:54-07:00"></time></p>  </footer>  </article>

<footer>
<nav> 
<p>  <a href="/credits.html">Credits</a>  <a href="/tos.html">Terms of Service</a>   <a href="/index.html">Blog Index</a>  </p> 
</nav>
<p>Copyright ©2015 Tahlildadeh</p>  
</footer>

====================================================================================================================================================

4- nav : برای مسیر یابی مناطقی از سایت به کار میروند که لینک هامون در اون جا قرار داره و معمولا داخل اون ها از تگ های لیست استفاده میکنیم

====================================================================================================================================================

5- aside  : عناصری هستند که تا بخشی به محتوای اصلی ما مربوط می شوند اما میتوانند از آن جدا شوند قسمت هایی که خوانند میتونه از خواندن آن ها صرف نظر کند این تگ در کنار محتوای اصلی مون میاد
و قرار میگیره

<article>
 <p>  As of writing, the only web browser completely support date time input is Opera  </p>
 <aside>  Picking a date from Calendar is not the only way to input a date value even though it's the most popular   </aside>
</article>

====================================================================================================================================================

6- main : محتوای اصلی صفحه را مشخص می کند. محتوای درون این تگ باید به صورت یونیک باشد. نباید مطالبی شامل سایدبار، فهرست ناوبری، اطلاعات کپی رایت، لوگو سایت یا فرم جستجو باشد در بین این تگ
باشد nav , footer, aside , article استفاده شود. همچنین این تگ نمی تواند از فرزندان تگ های main  استفاده کرد همچنین در صفحه نباید بیش از یک تگ article و section   می توان از تگ های

====================================================================================================================================================

7- Article این تگ همانند تگ سکشن هستش و در داخل اون میتونیم سایر تگ های سمانتیک رو استفاده بکنیم به غیر از خود این تگ

<article>
<header> <h1>The Very First Rule of Life</h1>  <p><time pubdate datetime="2009-10-09T14:28-08:00"></time></p> </header>
<p>  If there's a microphone anywhere near you, assume it's hot and  </p>
<footer>  <a href="?comments=1">Show comments...</a>  </footer>
</article>

نکته : برای جا افتادن استفاده از این دو تگ فرض کنیم که ما یک صفحه از چندین قسمت مختلف ولی مرتبط با هم داشته باشیم آن ها را در یک سکشن قرار میدهیم و حالا هر
قرار میدهیم اگر قسمت های مختلفی در صفحه ما وجود داشت که با هم هیچ ارتباطی نداشتند از تگ دیو استفاده article  کدوم از قسمت هارو که ریز تر هستش رو میایم و در  یک  
میکنیم که نسبت به دو تگ قبلی بازه بزرگتری را پوشش میدهد

====================================================================================================================================================

8- details .... summary .... 

9- mark   اگر یک قسمت از متن امون خیلی مهم بود بهتر هستش که بیایم و اون قسمت رو در داخل این تگ قرار دهیم

10- time برای نشون دادن زمان بهتر هستش که بیایم و از اون به شیوه زیر استفاده بکنیم

We were celebrating our daugther's <time datetime="2004-07-13">birthday</time> in that seafood restauran

I usually go swimming at <time datetime= " 20:00 " >20:00</time> every Saturday.

====================================================================================================================================================

11-figure / figureCaption (برای عکس ها و میتونه مهم و مفید باشه)
ازاین نوع تگ هم برای عکس ها و هم برای نمودار ها و جداول استفاده میکنیم
<figure>
     <img src=""  alt="" style="">
     <figureCaption> </figureCaption>
</figure>

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================
*/
