/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

map : استفاده از این تگ برای موقعی که ما میخایم بیایم و یک تصویر رو تبدیل به یک نقشه بکنیم به این صورت که این تصویر به بعضی از نقاطش که کلیک شد حالت لینک
پیدا کند 

map : : area درونش یک سری تگ که یک سری خصوصیت دارد 
            shape : circle rect   default(مربع)  ploy
            coord          :             href
      
<img src="workplace.jpg" alt="Workplace" usemap="#workmap" width="400" height="379">

<map name="workmap">
  <area shape="rect"           coords="34,44,270,350"           alt="Computer" href="computer.htm">
  <area shape="poly"          coords="290,172,333,250"       alt="Phone" href="phone.htm">
  <area shape="circle"        coords="337,300,44"                alt="Cup of coffee" href="coffee.htm">
  <area shape="default"     coords="337,300,44"                alt="Cup of coffee" href="coffee.htm">
</map>

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
