/*
====================================================================================================================================================
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

svg ; به این مدل تگ ها اصطلاحا بوم های نقاشی میگویند که برای ترسیم های دو بعدی داخل محیط مرورگر هستند

1- vector Graphic   2- Raster Graphic  ما به طور کلی دو مدل تصاویر گرافیکی داریم 

- vector Graphic : هستش svg  تصاویر برداری مقیاس پذیری هستند که از  اشکال هندسی تشکیل شدند و خارج از رزولشن هستند و افت کیفیت ندارند و معروف ترین آن ها 

- Raster Graphic :  PNG  GPEG   تصاویر شطرنجی هستند که با تغیر سایز میتونن افت کیفیت داشته باشند مثل تصاویر هایی از نوع 

هستند vh هستند بر مبنای svg  اندازه صفحاتی که با استفاده از 

====================================================================================================================================================

1- Rectangle مستطیل  :  width  height  /  viewBox :  x y width height مختصات رو نسبت به گوشه های سمت چپ و بالای صفحه میاد و مشخص میکنه  / rx , ry : گرد کردن گوشه هارو برامون انجام میده

<!--<rect id="rect" x="10" y="10" height="100" width="180"></rect>-->

#rect{  fill: none; stroke: #0f6674;  stroke-width: 3px;     stroke-linejoin: miter;    stroke-dasharray: 17px;     stroke-linecap: round;   }
   
====================================================================================================================================================

2- circle  :  r  : شعاع داره    cx  cy  :  فاصله از مرکز دایره برای جابه جایی دایره امون 

<circle r="100" cx="150" cy="200" style="fill: chartreuse;"></circle>

====================================================================================================================================================

3- Ellipse  cx   cy   rx  ry  برای جهت دهی کردن به المان هامون هستش 

<ellipse cx="130" cy="70" rx="80" ry="50" style="fill: hotpink"></ellipse> 

====================================================================================================================================================

4- line x1  y1    x2    y2  نقاط شروع و نقاط پایان خط هامون هستش

<line x1="15" y1="15" x2="80" y2="100" style="stroke: aqua; stroke-width: 15px;stroke-linecap: round"></line>

====================================================================================================================================================

5- polyline /  polygon : تصاویری که حداقل 3 تا وجه دارند

<polygon points="100,10 40,198 190,78 10,78 160,198" style="fill: gold;fill-rule: evenodd"></polygon>

<polyline points="40,80 80,80 80,120 120,120 120,160 160,160" style="fill: none;stroke: brown;stroke-width: 3px;"></polyline>

====================================================================================================================================================

6-path : برای ساده دهی کردن مسیر دهی ها هستش و میشه هر کاری رو باهاش بیایم و انجام بدیم

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================
 */
