/*

Proxy API

میاد یک حائل یا لایه میانی بین خودمون و شی مورد نظر قرار دهیم مثلا میتوانیم یک شی رو با استفاده از پراکسی پوشش بدهیم و با استفاده از ترپ یا حبس کد رفتار اون هارو تغیر بدهیم


let proxy = new Proxy(target , handler )
کاربرد آن ایجاد کردن غیر رفتار و مدیریت کردن اون تغیر رفتار درآبجکت مورد نظرمون هستش   ما با استفاده از آن ها میتوانیم رفتار پیش فرض و مربوط به عملگرد ها و متد های مختلف رو متناسب
  با نیازشون تغیر بدهیم پروکسی بین ما  و چیزی که میخایم با آن ارتباط برقرار کنیم قرارمیگیردو به عنوان تماینده ای
  از ما کارمون رو انجام میدهد
  
Proxy Server : چیزی هست که بین ما و سرور قرار میگیرد و قابلیت تغیردادن درخواست های  و پاسخ های
انتقالی بین سرور و کاربر را دارد از پراکسی ها برایجست و جو مخفیانه استفاده می شود  با استفاده از آن ها
می توانیم به سایت های فیلتر دسترسی داشته باشیم
  
نکته : در داخل اکما6  پروکسی بین کدها و شی مورد نظرمون قرار میگیرد و ما مستقیما با شی امان کار نداریم
  و کارهایی که میخاهیم رو میایم رو از طریق پروکسی درخواست کرده و پروکسی هم در پس زمینه
  با شی ارتباط برقرار کرده و نتیجه رو دراختیار ما قرار میدهد و ما با استفاده از پراکسی ها میتوانیم رفتار های 
  مربوط به شی امان رو تغیر بدهیم و جواب های برگشتی برای شی مورد نظرمون رو تغیر بدهیم و برای موارد مختلف
  استفاده بکنیم
  
  کاربرد پراکسی ها :
  1- بالا بردن امنیت اپ هامون 
  2- میتوانیم بفهمیم که توابع چقد طول میکشد که اجرا بشن و چیز های مورد نظرمون رو لاگ کنیم
  3- می توانیم رفتار توابع و اشیاء رو تغیر دهیم
  4-استفاده در اعتبارسنجی ورودی و خروجی

  کلید واژه های مهم پیرامون پراکسی ها  :
  target : شی اصلی که پروکسی اون رو میگیرد و این شی می تواند
  یک کتابخانه یک آرایه و یا حتی یک پراکسی دیگر باشد
  handler : یک شی که رفتار پروکسی رو مشخص و پیاده سازی میکند
  traps : متدهایی که در داخل هندلر تعریف می شن و نقش
  دام رو ایفا میکنند و زمانی که مورد نیاز باشند اجرا میکند
 
  */


 