/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================
   
Hyper Text markup lanquage     //        <!DOCTYPE html> :  For HTML 5           //       DOM : Document Object Model 

ما در داخل این زبان چیزی با نام خطا نداریم که بهمون نمایش بده فقط بحث استاندارد نویسی برای نمایش اون محتوا رو داریم  و کنسول مرورگر امون فقط  میاد و خطاهای جاوااسکریپتی رو
به ما نمایش میدهد

Document  :   سند فایل            Tag html  :   ریشه کل تگ ها موجود در سند

<html lang="en"> :  lang="en" : برای تغیر زبان سندمون هستش       dir : " rtl " : جهت سند وب مارو مشخص میکند       

<meta http-equiv="X-UA-Comp atible" content="IE=edge" />   سازگاری با مرورگر های ماکروسافت 

Tag head : شاخه های درخت امون محل قرار گیری تگ های متا و مواردی که به سند امون مربوط هستش در این جا قرار میگیره اون تگ های توصیفی مرورگرمون
داخل این تگ قرار میدهیم
       
متا تگ ها برای مبحث سئو به شدت مهم هستش

<meta charset="UTF-8" : برای قرار گیری درست کاراکتر ها در سندمون هستش 

<meta name="viewport" content="width=device-width, initial-scale=1.0"> 
            name="viewport" : responsive design
            content="width=device-width : گرفتن عرض کل سندمون
            initial-scale=1.0 " : جلوگیری از  درگ کردن در داخل سندمون
           <title  مشخص کردن عنوان سندمون  در داخل سئو تاثیر مثبت دارد

<meta http-equiv="refresh"  content="30">   این تگ داکیومنت رو میاد و هر 30 ثانیه یک بار رفرش میکنه 

<meta name="theme-color"  content="#7533" >

<link name="icon"  href="@favion/icon.png" >

Tag body : تنه ی درخت امون

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

block Element : Full width : div : width : 100% عناصری هستند که عرض سند رو میان و به طور کامل پر میکنن و به محتوای داخل اون کاری ندارند و
صرفا هدفشون پر کردن عرض سندمون هستش

inline Element  : Element witdh  به اندازه محتوای درونشون  : span a عناصری هستند که عرض اشون رو به اندازه ی محتوای داخل اشون میان و پر میکنن 
می شود این دو تا رو باهم دیگه ترکیب کرد

نکته : بهتر هستش از تگ های که به صورت بلاکی هستند داخل تگ هایی که به صورت اینلاین هستند استفاده نکنیم

slef-closeing / open closeing

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

CDN : ما وقتی میایم و برای استفاه از یک پکیج از این ویژگی استفاده میکنیم باعث میشه که تعداد ریکوست های ما در پروژه امون بیشتر بشه

برای بالا رفتن سرعت لود وب سایت بهتر هستش که بیایم و تگ اسکریپت سایت امون رو در آخر تگ بادی قرار بدهیم 

<script async src="myscript.js"> و صبر نمیکنه تا جی اس لود بشه در بکگراند میره دانلود میکنه ولی پارز نمیکنه صبر میکنه کد های html میره ادامه میده به پارز کردن کدهای 
که پارز شد میاد و اون هار اجرا میکنه html

<script defer src="myscript.js"> تموم شد بیا هم دانلودش کن و هم اجراش کن  html میگه وقتی پارز کردن کد های 

میرسه میاد و همه ی اون هارو لود میکنه و بعد اجرا میکنه و منتظر وای نمیسه این وسطش و وقتی  دانلود کرد میاد  و برا اساس  css  مرورگر وقتی به کد های مربوط به 
رو برای ما میسازه  css om  اون درخت 

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================
*/
