/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
===================================================================================================================================

حالا میتونیم برای تست نویسی بیایم و به شیوه زیر عمل بکنیم

Mock Service Worker : یک موقعی هستش ما داریم یک کدی رو مینویسیم یک موقعی هستش که یک بخش هایی از کدهامون یا سرویس هامون در اختیار ما نیستند و ما نمی تونیم اون
فانکشنالیتی رو در اختیار داشته باشیم برای همین اون فانکشنالیتی اصلی رو با یک فانکشنالیتی فیک جا به جا میکنیم که برای نصب اون از 

yarn add msw --dev برای نصب اون از این دستور استفاده میکنیم

حالا اگر بخایم بیایم و  یک تست سرور راحت تر بگیریم میتونیم به شیوه زیر عمل بکنیم

import { reset }  from "msw"
import { setupServer } from "msw/node"

const server = setupServer(()=>{
    rest.get("/post/:id" , ( req , res , ctx ) => {
        return res(ctx.json({
              title : "sample post title" , 
              body : "sample body"
        }))
    }
})

beforeAll (()=> { server.listen() )
afterEach ( () => server.resethandlers() )
afterAll ( () => server . close() )


 ===================================================================================================================================
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
