/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
===================================================================================================================================
  
برای درست کردن برنامه های ری اکتی امون استفاده بکنیم میاد و خودش به صورت پیش فرض تنظیمات تست نویسی مارو انجام میده برای اجرای تست هامون CRA  خوب ما اگر بیایم و از 
رو انتخاب بکنیم میاد a استفاده بکنیم که چن تا حالت رو به ما نشون میده تا انتخاب بکنیم برای مثال اگر بیایم و حالت  yarn start test   /   npm  start test  ما میتونیم بیایم و از دستور 
و هرچی تست داریم رو برامون انتخاب و اجرا میکنه

میتونیم بیایم و حالت های مختلف دیگه رو عوض کنیم برای مثال  Watch Usage یا  w و با زدن گزینه

f  :  شدن رو مجدد اجرا میکنه fail اونایی که 

o : اون هایی که تغیرات داشته رو میاد و فقط عوض میکنه


===================================================================================================================================

// Greeting.jsx

const Greeting = () => <div>Hello</div>;

export default Greeting;

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// Greeting.test.jsx

import { render, unmountComponentAtNode } from "react-dom";

import Greeting from "./Greeting";

test("display greeting message", () => {
    const contianer = document.createElement("div");
    document.body.appendChild(contianer);
    render( < Greeting / > , contianer);
    expect(contianer.textContent).toBe("Hello");
    unmountComponentAtNode(contianer); 
    contianer.remove();  
});

// unmountComponentAtNode(contianer); چون ما از کامپوننت های ری اکتی استفاده میکنیم وقتی اون هارو پاک میکنیم باید به جاهای دیگه که ازش استفاده بکنیم
     رو انجام میدهد unmountComponent بگیم بیاد و اون رو پاک بکنه تا الکی فراخوانی نشه و یک جورایی برای ما عملیات های

// contianer.remove();   میاد و کامپوننت امون رو پاک میکنه 

===================================================================================================================================
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
