/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
===================================================================================================================================

انجام میدهیم ممکن هستش یکسری عملیات ها داشته باشیم که زمان بر باشه و یکسری رویداد داشته باشیم و یکسری دیتا فچ داشته باشیم و یکسری موارد  render موقعی که ما میایم و
شده باشه برای این حالت یک تابعی fail  دام ما آپدیت نشده باشه و همه  موارد رو نداشته باشه برای همین وقتی تابع ما میاد و اجرا میشه ممکنه بیاد و اصطلاحا expect که ممکنه زمانی که 
درست شده که میگن بیاین و اون اکت اتون رو داخل اون تابع بنویسین برای همین به شیوه پایین میایم و کد بالا رو اصلاح میکنیم act  به نام 

import { act } from "'react-dom/test-utils"

act(()=>{ render( < Greeting / > , contianer); }) ما به درستی آپدیت شده باشه Dom  میرسه  expect حالا با انجام این کار این تضمین هستش که زمانی که خط کد ما به قسمت
    
===================================================================================================================================

معرفی پترن تری بل ای که برای مستند کردن بهتر تست هامون هستش که میتونیم بیایم و استفاده بکنیم و کاری که انجام میده این هستش که میاد و اجزای تست مارو به بخش های مختلفی 
تقسیم میکنه 

1 - arrange : پیش شرط های محیطی رو در این قسمت میایم و قرار میدهیم

2 - act : اون اتفاق یا رندری که قراره اتفاق بیوفته عملیات هایی مثل رندر شدن یا کلیک شدن

3- assert : اون قسمتی که در نهایت باید دیده بشه

test("display greeting message", () => {

    // arrange

    const contianer = document.createElement("div");
    document.body.appendChild(contianer);

    // act

    act(()=>{ render( < Greeting / > , contianer); })

    // assert

    expect(contianer.textContent).toBe("Hello");
    unmountComponentAtNode(contianer);
    contianer.remove();
});
 
===================================================================================================================================
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
