/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
===================================================================================================================================

setup & teardom :   خوب ما برای نوشتن تست هامون یکسری کارهای تکراری رو باید بیایم و انجام بدیم از جمله  اضافه کردن و پاک کردن یک المنت مثل شیوه بالایی
خوب ما در بالا کلن یک تست داشتیم حالا میایم و کدبالا رو اصلاح میکنم

let container = null;

beforeEach(() => {
    const container = document.createElement("div");
    document.body.appendChild(container);
});

afterEach(() => {
    unmountComponentAtNode(container);
    container.remove();
    container = null;
});

test("display greeting  message", () => {
    act(() => {
        render( < Greeting / > , container);
    });
    expect(container.textContent).toBe("Hello");
});

===================================================================================================================================
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
