/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
===================================================================================================================================

استفاده کردیم میتونیم بیایم و به صورت زیر تست نویسی اون هارو انجام بدیم برای مثال ما میخایم بیایم و در کامپوننت timing  موقعی که ما در کدهامون اومدیم و از مطالب مربوط با 
استفاده بکنیم برای این منظور کامپوننت زیر را در نظر بگیرید   setInterval  setTimeout  امون از یکی از توابع مربوط به

// Counter.js

const Counter = () => {
    const [count, setCount] = useState(0);

    useEffect(() => {
        
        const clear = setTimeout(() => {
            setCount((c) => c + 1);
        }, 5000);

        return () => {
            clearTimeout(clear);
        };
    }, []);

    return (
        <div>
            <p>{count}</p>
            <button onClick={() => setCount(count + 1)}>increment</button>
        </div>
    );
};
export default Counter;

===================================================================================================================================

jest.useRealTimers();  و  jest.useFakeTimers(); برای استفاده باید بیایم و قبل و بعد از تست هامون اون تابع های زماندار رو شبیه سازی کنیم با استفاده از توابع

let container = null;

beforeEach(() => {
    container = document.createElement("div");
    document.body.appendChild(container);
    jest.useFakeTimers();
});

afterEach(() => {
    unmountComponentAtNode(container);
    container.remove();
    container = null;              
    jest.useRealTimers();     ما در داخل این مرحله دو تا تابع دیگه رو هم داریم که میتونیم بیایم و اون هارو اجرا بکنیم به نام های
}); 

jest.runAllTimers();   قبل از برگشتن به حالت نرمال تمام اون تایمر هایی که اومدیم و ست کردیم رو برمیگردونه به حالت نرمال
jest.useRealTimers(); 


jest.runAllTimers();   قبل از برگشتن به حالت نرمال میتونه بیاد و تمام اون تایمر هایی که ست کردیم رو پاک بکنه
 jest.useRealTimers(); 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
