/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
===================================================================================================================================

برای تست نویسی هامون استفاده بکنیم برای همین در ابتدا میایم و به شیوه زیر عمل میکنیم testing libray خوب ما الان دیگه میخایم بیایم و از کتابخونه  

render  برای اضافه کردن تابع 

// before

import { render } from "react-dom";

// after

import { render } from "@testing-library/react";

===================================================================================================================================

میتونیم دو تا متد در داخل اون استفاده بکنیم testing libray که با استفاده از پکیج  render تابع 

it ( " render hello " , () => {

   const { debug , container } render( < App / > );

    debug ( ); // خروجی کد مارو نشون میدهد

    console.log( container.innerHTML )  // محتوای کد مارو نشون میده انگار اون روت ای که داخل ان کامپوننت ما رندر شده رو بهش دسترسی داریم

});

===================================================================================================================================

render از  debug , container   برای ما هستش که به جای اینکه ما بیایم و متد های body که معادل خطوط کد داخل تگ  testing libray که با استفاده از پکیج  screen تابع 
استفاده بکنیم میتونیم از این استفاده بکنیم که استفاده ی خیلی راحت تری هم دارد

import { render, screen } from "@testing-library/react";

import { App } from "./App";

it ( " render hello " , () => {

    render( < App / > );

    screen.debug();
});

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
