/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
===================================================================================================================================
 
testing libray به طور کلی دو تا دیدگاه برای تست نویسی وجود دارد در ابتدا یکسری پکیج ها مارو به این سمت می برن که بریم و پیاده سازی رو تست بگیریم ولی فلسفه وجودی پکیج 
این نیستش که بریم و پیاده سازی رو تست بگیریم بلکه باید بیایم و خروجی رو از دیدگاه کاربر تست بگیریم که چه چیزی رو میبینه و تحویل میگیره و این به عنوان دیدگاه دوم هستش

حالا برای اینکه بتونیم اون کامپوننت که رندر شده رو بیایم و سلکت یا انتخاب اش بکنیم با استفاده از سلکتور های پیش فرضی که خود جی اس در اختیار ما قرار میده امکان سلکت کردن
یک سری توابع برای سلکت راحت تر به ما داده که میتونیم از دیدگاه کاربر بیایم و این کار رو انجام بدهیم testing libray هستش ولی خوب کار سخت تر هستش برای همین 

types of Queries :  راه های انتخاب کردن یا سلکت امون به تریب اولویت اشون

===================================================================================================================================

1 - getBy  / getAllBy

   - getByRole  
   
هستش برای مثال اگر بخایم یک دکمه رو انتخاب کنیمbutton / checkbox / link / gridcell  نکته : با استفاده از سلکتور بالا چیز هایی که انتخاب میشه برامون 
example  = getByRole("button", { name : /submit/i })
         
   - getByLabelText 
   - getByPlaceholderText
   - getByText
   - getByDisplayValue
   - getByAltText = img area input ..

    -getByTestId : استفاده میکنیم به نام data-Test-هd  اون المان و بعد انتخاب اش میکنیم data-atribute اگر هیچ کدوم از روش های بالا نشد میایم و از یک 

===================================================================================================================================

2 - queryBy / queryAllBy : با بقیه المان ها برای انتخاب کردن در این هستش که زمانی که از این نوع استفاده میکنیم اگر اون المان  امون پیدا نشه یا اصطلاحا مچ queryBy تفاوت
نشده باشه هیچ پیغام خطایی رو به ما نمی دهد ولی بقیه مدل های انتخاب کردن برامون خطا رو ایجاد میکنند

استفاده میکنیم getBy موقعی استفاده میکنیم که بخایم تایید بکنیم چنین دکمه ای در داخل صفحه وجود ندارد ولی برای موقعی که میخایم ببینم موجود هستش یا خیر میایم و از queryBy

3 - findBy / findAllBy  از این حالت بهتره برای مواقعی استفاده بکنیم که یک المان داریم که در داخل صفحه میاد و به صورت اسینک عمل میکنه و اگر المان امون قرار بود
اول نباشه بعد یکسری تغیرات بیاد بهتره از این مدل برای انتخاب المان هامون استفاده بکنیم 

===================================================================================================================================

استفاده میکنیم اگر یک نوع انتخابی داشته باشیم فقط همون رو برامون بر میگردونه ولی وقتی نوع های انتخابی مون findBy و queryBy و getBy نکته : موقعی که از انتخاب گر های 
اشون استفاده بکنیم که به ما یک آرایه رو در صورت انتخاب به طور کلی all بیشتر از یک مورد هستش میاد و برای ما خطا رو ایجاد میکنه که برای رفع این مشکل باید بیایم و از متد های 
بر می گردونند

===================================================================================================================================

testing playground :   یک سایت هستش همراه با یک افزونه که به انتخاب کردن المان هامون بهمون کمک میکنه تا راحت تر اون هارو برای انجام تست نویسی امون انتخاب بکنیم

===================================================================================================================================

دیگه هم داشته باشیم  matchers میتونیم بیایم و یکسری github/testing-library/jest-dom  ما با استفاده از 

toBeDisabled
toBeEnabled 

.
.
. 

toBeInTheDocument این متنی که انتخاب کردیم باید در داخل سند امون باشه

که برای هر کدوم در بالا یکسری توضیحات وجود دارد

===================================================================================================================================
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
