/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Problem Solveing :  ما میتونیم حل مسئله رو به عنوان فرآیند دریافت مقدار ورودی ( مسئله ای که میخاهیم حل کنیم ) و تولید برخی خروجی ها ( راه حل مشکل خود ) در نظر بگیرم

انواع شمارنده ها 

1- Unary :  شمارش معمولی که هر رقم نماینده یک واحد هستش
2- decimal :  سیستم شمارش اعضاری
3- binary :  یا سیستم 0 یا 1 که بر مبنای  دو هستند و به هر رقم اون یک بیت میگویند

به اضای هر 8 بیت یک بایت رو داریم

001  :   numbers 1  / 010 : numbers 2  /   011 : number 3 /   100 :  number 4 / 101: number 5 /  110 : number 6 /  111 : number 7

این مبنای 0 یا 1 بودن بر مبنای خاموش یا روشن بودن یک لامپ هستش که این لامپ ها با یک سوییچ میان و روشن و خاموش می شوند که در داخل کامپیوتر های مدرن
ملیارد ها سویچ کوچ داریم به نام ترانزیستور که با خاموش یا روشن کردن اون ها میشه مقادیر مختلفی رو نمایش داد همچنین برای این که یک عدد رو به مبنای دو ببریم باید 
اون رو تا جایی که میتونیم تقسم بر دو بکنم

25  ÷  2   =  12    = %  1 
12  ÷  2   =  6     = %  0
6   ÷  2   =  3     = %  0 
3   ÷  2   =  1     = %  1
1   ÷  2   =  0     = %  1

10011  نتیجه نهایی

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

وقتی یک ایموجی دریافت می کنیم، کامپیوتر ما در واقع فقط یک عدد را به صورت باینری دریافت می کند که سپس بر اساس استاندارد یونیکد به تصویر ایموجی نگاشت می شود

که سه تا بایت رو دریافت میکنه و رنگ رو نشون میده و با استفاده از این استاندارد RGB  ما با استفاده از بیت ها میتونیم بیایم و رنگ هارو نمایش بدیم مثل استفاده از استاندارد 
میتونیم بیایم و پیکسل هارو هم نمایش بدیم

MIDI همچنین ما میتوانیم موسیقی و یا صوت هارو هم با استفاده از بیت ها نمایش بدیم با استفاده از استاندارد 

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

ASCII /  Unicode :   که برای متن ها میان و استفاده می شوند در واقع این  نوع استاندارد ها یک نوع پروتکل های جهانی هستندEncoding  هر دو تا استاندارد هایی هستند برای 
که میتوانند باعث ارتباط زبان های مختلف باهم باشند

Unicode : یکی از استاندارد های معروف اون هستش  UTF-8  یک استاندارد برنامه نویسی برای سازگاری و ارتباط بهتر زبان های مختلف باهم دیگه هستش  که 

تفاوت های اسکی و یونیکد

تعداد کاراکتر بسیار زیادی را پشتیبانی می کند Unicode اجازه استفاده از 128 کاراکتر را می دهد اما   ASCII 
است  UTF-8 در حال جایگزین شدن با ASCII دارند اما WWW  بیشترین استفاده را در پروتکل UTF-8 و ASCII 
با ترتیب حروف الفبایی است ASCII ترتیب کدگذاری 
بر اساس اعداد منحصر به فرد است Unicode  ترتیب کدگذاری
کاراکترهای زبان انگلیسی مورد استفاده قرار می گیرد Encoding  بیشتر برای  ASCII 
تقریبا همه کاراکترهای زبان های مختلف مورد استفاده قرار می گیرد Encoding برای  Unicode 
برای نمایش از ساختار 8 ، 16 و 32 بیتی استفاده می کند Unicode 
برای نمایش از ساختار و فرمول 7 بیتی استفاده می کند ASCII 
در نمایش صفحات وب است ASCII و Unicode در نهایت بیشترین تفاوت

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
