/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================

نرمال سازی داده یکی از مهم ترین مباحث هستش که باید بدونیم و باید داده هامون رو همیشه بیایم و نرمال اشون بکنیم برای این کار هم راه های مختلفی هستش

//  داده هایی که نرمال نیستند  که آرایه ای از آبجکت های اطلاعات پست هامون هستش که هر  کدوم از اون ها شامل اطلاعاتی هستش که و داخل هر پست امون یک سری
کامنت هم داریم که مجموعه از کامنت هامون هستش که این مدل ساختار ها خیلی تو در تو هستند و زمانی که بخایم یک بخشی رو تغیر بدیم برای رسیدن به اون راه زیادی داریم
که بهتر هستش این تو در تو بودنه رو باید کم کنیم و همچنین اطلاعات میاد و در چند جا ذخیره میشه که این هم خوب نیست که یک اطلاعات یکسان در چند جا ذخیره بشه چون 
موقعی که بخایم آپدیت کنیم باید در چند جا این کار بکنیم و اطلاعات رو باهم دیگه سینک نگه داریم و دسترسی به اطلاعات رو با حلقه باید به دست بیاریم

const blogPosts = [
  {
    id: 'post1',
    author: { username: 'user1', name: 'User 1' },
    body: '......',
    comments: [
      {   id: 'comment1',    author: { username: 'user2', name: 'User 2' },    comment: '.....'     },
      {   id: 'comment2',     author: { username: 'user3', name: 'User 3' },     comment: '.....'       }
    ]
  },
  {
    id: 'post2',
    author: { username: 'user2', name: 'User 2' },
    body: '......',
    comments: [
      {     id: 'comment3', author: { username: 'user3', name: 'User 3' }, comment: '.....'       },
      {     id: 'comment4',    author: { username: 'user1', name: 'User 1' },      comment: '.....'    },
      {     id: 'comment5',   author: { username: 'user3', name: 'User 3' },      comment: '.....'    }
    ]
  }
  // and repeat many times
]

// خوب ما بهتر هستش که بیایم و به شکلی که این دیتا ها در جداول امون میاد و ذخیره میشه بیایم و به اون شکل به این ها نگاه بکنیم  و باید فرض کنیم که همه ی اون ها به صورت جدا ذخیره می  شوند
پست ها کامنت ها و کاربران رو بیایم و جدات کنیم برای مثال بالا

{
    posts : {
        byId : {
            "post1" : {   id : "post1",      author : "user1",  body : "......", comments : ["comment1", "comment2"]    },
            "post2" : {   id : "post2",    author : "user2",   body : "......",   comments : ["comment3", "comment4", "comment5"]  }
        },
        allIds : ["post1", "post2"]
    },
    comments : {
        byId : {
            "comment1" : {   id : "comment1",  author : "user2",       comment : ".....",   },
            "comment2" : {  id : "comment2",   author : "user3", comment : ".....",     },
            "comment3" : {  id : "comment3",   author : "user3",    comment : ".....",     },
            "comment4" : {  id : "comment4", author : "user1",   comment : ".....",     },
            "comment5" : {    id : "comment5",     author : "user3",     comment : ".....",  },
        },
        allIds : ["comment1", "comment2", "comment3", "comment4", "comment5"]
    },
    users : {
        byId : {
            "user1" : {  username : "user1",  name : "User 1", },
            "user2" : {   username : "user2", name : "User 2",       },
            "user3" : {  username : "user3",   name : "User 3",   }
        },
        allIds : ["user1", "user2", "user3"]
    }
}

====================================================================================================================================================

حالا مدلی که خود ریداکس میگه بیا و نرمال سازی دیتا رو انجام بده به صورت زیر هستش


{
    simpleDomainData1: {....},
    simpleDomainData2: {....},
    entities : {
        entityType1 : {....},
        entityType2 : {....}
    },
    ui : {
        uiSection1 : {....},
        uiSection2 : {....}
    }
}

نمونه کد بالا

{
    entities: {
        authors : { byId : {}, allIds : [] },
        books : { byId : {}, allIds : [] },
        authorBook : {
            byId : {
                1 : {
                    id : 1,
                    authorId : 5,
                    bookId : 22
                },
                2 : {
                    id : 2,
                    authorId : 5,
                    bookId : 15,
                },
                3 : {
                    id : 3,
                    authorId : 42,
                    bookId : 12
                }
            },
            allIds : [1, 2, 3]

        }
    }
}

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
