/**
 -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

توابع کاربردی رشته ها      toUpperCase( )         toLawerCase( )        length

- ها استفاده بکنیم  template string اگر ما خواستیم بیایم و از رشته ها استفاده بکنیم که در داخل آن ها از متغیر ها قراره استفاده بکنیم  بهتره از 

-  if ( name ! == '' ) { }  برای چک کردن اینکه یک رشته امون خالی هستش یا نه میتونیم از شرط زیر استفاده بکنیم

-  که میتونیم بیایم و چندین متد رو پشت سر  هم استفاده بکنیم chaing  مفهوم 

const message = "wellcome to advance Javascript Course"        const join2 = message.split(" ").join("-")          console.log(join2)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

1 - split(separator,limit) : برای جدا سازی و برش در رشته امون هستش که یک خروجی آرایه میاد و به ما می دهد آرگومنت اول میاد و میگه با
چی بیام و جدا کنم و دومی هم میاد میگه که تا چند تا جدا کنم

split( چندتا ,  با چی )  :   conver string to array

let str = "emad/ta/ghipour";           console.log(str.split("/",2));              console.log(str.split("/",3));       console.log(str.split("/",1));

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

2- CharAt(Index)  ==> Value    در داخل یک رشته مقدار ایندکس اون رو میگیرد و مقدار اون رو بر می گردوند

let Name = "Emad Taghipur";     console.log(Name.charAt(1));

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

3- substr :   برای برش زدن از یک رشته که رشته اصلی مارو تغیر نمیدهد و به عنوان ارگومنت ایندکس شروع و پایان رو میگیرد
 
let Name = "EmadTaghipur";      console.log(Name.substr(0, 5));      console.log(Name);

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

4- startsWith   ,     endsWith   :  این دو تا تابع میان و یک رشته رو به عنوان  پارامتر ورودی میگیرند و رشته مارو چک میکنند که اگر این مقداری که وارد 
کردیم در اول یا اخر رشته بود برامون یک مقدار بولین رو برگشت میدهند و به عنوان پارامتر دوم هم یک ایندکس برای شروع هم میان و میگیرند
 
var str = "Hello world, welcome to the universe";       var n = str.startsWith("Hello");     var e = str.endsWith("rse.");
 
console.log(n, e);

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

5- replace(arg1,arg2) :  برای تغیر دادن یک رشته میاد و استفاده می شود که اولی میاد و اون رشته میگیره و دومی مقداری که باید جایگزین شود رو میگیره
و در غالب یک کپی به ما بر میگردونه و میادو  اولین مقداری رو که با شرط ما برابری میکنه رو تحویلمون میده و اگر لازم هستش که بیایم و همه ی اون هارو تغیر
استفاده بکنیم replaceAll بدهیم میتونیم بیایم و از متد 

let name = "emad emad Ta";           console.log( name.replace ("emad", "ali" ));              // ali emad Ta
let name = "emad emad Ta";           console.log( name.replaceAll ("emad", "ali" ));         // ali ali Ta

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

6- trim ( )  این تابع میاد کلن فضای خالی رو از اول و انتهای رشته امون حذف میکنه 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

7- indexOf() : به عنوان پارامتر ورودی یک رشته میگیره و بررسی میکنه اگر پارامتر ما در رشته امون بود میاد و اندیس اون رو بر میگردونه و اگر نبود میاد و 
مقدار -1 رو  بر میگردونه 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

8- includes( )   :  میاد و یک رشته رو میگیره و در داخل اون چک میکنه که ایا داخلش هست یا نه و یک بولین رو برای ما بر میگردونه 

var str = "Hello world, welcome to the universe.";        var strCh = str.includes("H");          console.log(strCh);

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

All  Method

1-toUpperCase( )   //   toLaweCase( )   //   length
2 - split(separator,limit)
3- CharAt(Index) 
4- substr : 
5- startWith   ,     endWith   
6- replace(arg1,arg2)
7- trim ( ) 
8- indexOf()
9- includes( ) 
 
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 */
