/*

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

UTC 0  که میاد و برای ما یک زمان اصطلاحا صفر رو تعریف میکنه و میگه و اون رو به عنوان  time stamp ما در داخل بحث زمان یک مفهومی داریم به نام 
به ما میدهد که از تاریخ 1970 شروع میشه و گذر زمان از اون تاریخ میاد و شروع میشه و مبنای تاریخ و زمان مرورگر ها هم از اون تاریخ هستش برای استفاده
از اون میتونیم بیایم و از تابع زیر استفاده بکنیم

let time = new Date()

newDate( )     new Date( year , mounth ,  day ,  hourse , minutes , secound , miliseconds  ) 

حال ما دو تا تابع پر کاربرد داریم که میتونیم بیایم و زمان و تاریخ رو با استفاده از اون ها بگیریم 

1 -  toLocaleDateString  که تاریخ جاری رو به میلادی به ما میدهد
console.log(time.toLocaleDateString());

2- toLocaleTimeString  به ما میدهد AM  زمان سپری شده رو به صورت 
console.log(time.toLocaleTimeString());  

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

توابع پر کاربرد زمان

getTime : تعداد ثانیه های سپری شده  از تارخ اول ژانویه 1970 تا کنون            getDate : شماره روز جاری در ماه

getDay : شماره روز جاری در هفته     getMounth :شماره ماه جاری

getYear : شماره سال جاری     getHours : مقدار ساعت 

getMinutes : شماره دقیقه در یک متغیر زمانی        getSecounds : شماره ثانیه در یک متغیر زمانی 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



*/
