/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
border
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

border  : border-width / (dash solid ....) border-style / border-color

border-image : border-image-source / border-image-slice / border-image-repeat ; round // stretch 
موقعی که یک بوردر معمولی استفاده کنیم و مقدار رنگ برابر transparent  باشد

border-raduis : border-top-left / border-top-right  / border-bottom-left  /  border-bottom-right;

استفاده بکنیم کاربرد این ویژگی border-collapse: separate این ویژگی فقط موقعی میاد و اعمال میشه که ما بخایم بیایم و از پراپرتی  border-spacing
فقط در هنگام استفاده از جداول هستش و موقعی که بخایم بیایم و یک فضای خالی به مقادیر داخل سلول هامون بدهیم

table {  width: 100%;    border-collapse: separate     border-spacing: 10px; }

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
