/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Text
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

line-height برای دادن ارتفاع به خطوط امون به کار میبریم 
writing-mode :  horizontal-tb  vertical-rl ..... جهت متن مارو میاد و مشخص میکنه 

text-decoration  میتوان خطی رو بر روی نوشته یک عنصر یا بالای آن و یا پایین آن کشید و مقداری که میگیرید به شیوه زیر هست
text-decoration : none / o verline / line-through  /   underline  

text-transform :  این ویژگی برای متن های زبان انگلیسی که میاد و میگه که با حروف بزرگ یا کوچک نوشته شوند 
text-transform: lowerCase  UpperCase

text-indent  میزان فاصله خط اول از  لبه های اون رو مشخص میکنه   //  letter-spacing فاصله ی بین واژگان رو مشخص میکنه
word-spacing فاصله ی بین کلمات رو میاد و برای ما مشخص میکند

text-align :  یک عنصر در ارتباطه و مقدار پیش فرض اش با اون تغیر میکنه و با استفاده از اون میتوان تصمیم گرفت که چیدمان  direction  این ویژگی مستقیما با مقدار 
محتوای خطی مثل متن یا تصویر داخل یک عنصر بلاک به چه صورت باشد و روی فرزندان هم تاثیر دارد و فرزندانی که از نوع بلاک هستند رو هم میاد و تحت تاثیر قرار میده
میاد و با عناصر فرزند اش مثل متن رفتار میکند البته به شرطی که  text-align = center  نکته : وقتی به یک عنصر والدی که به صورت بلاکی هستش بیایم و استایل زیر رو بدهیم 
display : inline-block/ block فرزند مقدار زیر رو داشته باشد

word-break: break-all :  با استفاده از این ویژگی میتوان مشخص کرد یک متن زمانی که به آخر خط می رسیم آخرین کلمه ای که در خط کنونی جا نمی شود بشکند یا نه
overflow-wrap: break-word : می توان کلماتی که آنقدر طولانی هستند که از نگهدارنده خارج می شوند را به خط بعد شکست

در مورد کلمه میاد و تصمیم میگیره که کدوم بیاد و بشکند overflow-wrap در مورد خط word-break تفاوت های دو تای بالایی در این هستش 

vertical-align : به ما کمک میکند که  تا عناصری که به صورت خطی چیده شدندن در کنار هم رو بیایم و نسبت به راستای عمود تراز بندی کنیم بهترین مثال برای درک این ویژگی
استفاده از اون برای تصاویر هستند
  baseline : اگر یک متن و یک تصیر داشته باشیم پایین تصویر با خط امون در مبنای یک راستا خواهند بود که پیش فرض هم همینه
  baseline | sub | super | top | text-top | middle | bottom | text-bottom  

text-shadow : x:px در راستای / y:px در راستای/ blur:px  مقدار شفافیت / color  رنگ

BoxShadow : x:px / y:px / blur:px / اندازه سایه که مقدار پیش فرض 0 هست / color  برای اضافه کردن سایه به یک عنصر یا باکس استفاده می شود 
به اول این ویژگی میتونیم بگیم که که سایه به صورت داخلی اعتمال شود inset  با اضافه کردن 

white-space: nowrap;  وقتی کد میزنیمو  یک متن وارد میکنیم هنگام خروجی این متن چطوری نشون بده فضای خالی شو یا خط جدیدشو پاک کن یا نکن بهترین مثال برای استفاده
https://css-tricks.ir/reference/white-space/  از اون شعر هارو یادت بیاد لینک برای مطالعه بیشتر

over-flow :  تعیین می کند که محتوایی که از مرزهای عنصر خارج می شود, نمایش داده شود یا نه. و همچنین چگونگی نمایش را نیز تعیین می کند و فقط عناصری که از نوع بلاک
visible  مقدار پیشفرض     hidden;        scroll;        auto;         inherit;    هستند میان و سر ریز می شوند

text-overflow : ellipsis / clips / سر ریز شدن متن رو میاد و نشون میدهد که باهاش چکار کنیم بیایم و اون رو با سه نقطه نشون بدیم و یا اینکه برش بزنیم و نشون ندیم

box-sizing : border-box ;  رو بیایم و داخل خود اندازه باکس  امون اضافه کنیم و بیشتر از اندازه نشه و اون طول عرضی که میدهیم همون باشه  padding برای این هستش که مقدار 

userSelect : none برای موقعی هستش که میخایم وقتی کاربر روش کلیک کرد انتخاب نشه برای پروژه همبرگر منو خیلی کاربرد داره

outline :عنصر کشیده می شود که استفاده از آن به دلیل زیباسازی و یا بدلیل بهبود دستیابی border  از این ویژگی  می توان خطی اطراف یک عنصر رسم کرد در واقع این خط بیرون از حاشیه یا همان 
پذیری سایت می باشد   outline: 1px solid black;

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
