/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
source  :  http://getbem.com/
====================================================================================================================================================

Block-Element-Modifier - BEM :  

1--Block : نیستند Block هستند عناصر ul به واسطه این که وابسته به  li و یا اینکه تگ های header تگ هایی هستند که به خودی خود معنی دارند و وابسته به پرنت اشون نیستند برای مثال تگ
  
Examples :  header  ,  container ,  menu  , checkbox  ,  input 

====================================================================================================================================================

2--Element : عناصری هستند که وابسته هستند به بلوکی که داخل اش قرار گرفته اند معنای مستقلی ندارند و معنی دارند صرفا وابسته به اون بلاکی هست که داخل اون هستند و فقط وابسته باشند به بلوک خودشن

Examples :  menu__item  , list__item  , checkbox__caption  ,    header__title  ,  product-card__image  , product-card__title  ,  product-card__price 
                    card   ,   card__img-top   ,   card-img-bottom  ,   card__title  ,  card_desc  ,   card_btn

====================================================================================================================================================

3--Modifier : از این قسمت برای تغیر رفتار یا ظاهر یک المنت میایم و استفاده میکنیم و در کنار نامگزاری المنت ها و بلاک هامون به کار میروند یعنی هم زمان باید از دو تا ی اون ها کنار هم استفاده بکنیم
    
Examples :  isabled   ,   highlighted   ,   checked   ,   fixed   ,   size-big   ,   color-yellow

====================================================================================================================================================

نکات : 

 -  این قانون برای  همه شون قابل صدق هست  header-top  اگر نامی که خواستیم بنویسیم از دو کلمه نوشته شده بود با خط تیره میایم و اون هارو جدا میکنیم 

-  عناصری که به صورت بلاکی استایل دهی میشوند هیچ وابستگی به پرنت اشون ندارند برای همین وقتی اون هارو برداریم و به یک قسمت دیگه منتقل کنیم استایل هاشون هیج تغیری نمیکنه

-   استفاده بکنیم همچنین نباید استایل هامون رو به صورت تو در تو بیایم و بنویسیم چون اون قانون وابستگی که گفتیم div.headerنباید بیایم و به صورت تاکیدی برای مثال BEM در نامگذاری به روش
هارو به صورت تو در تو پیاده سازی شون Modifier رو نقص میکنه پس نباید بیایم و به صورت تو در تو اون هارو بنویسیم این قانون هم در نامگزاری بلاک ها و هم المنت ها صادق هست ما میتونیم بیایم و 
بکنیم

- سعی کنید کلاس هاتون معنی دار باشه و خیلی طولانی نباشه 

====================================================================================================================================================

مثال ها 

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

header  
  container
        nav
             menu 
                   menu__item
                         menu__link   menu__link--active

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

main 
  courses
      courses__title
            container
                 row 
                     course
                            course__img
                     course__content
                           course__title
                           course__desc
                           course__link       
       
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    loginform
         loginform__username 
               loginform__username--sucsess  
         loginform__passsword 
               loginform__username--error

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

     navbar    //     navbar__search-Box
     navbar__nav
         nav 
               nav__burger-checkbox
               nav__burger-label
               nav__mobile-wrap
                   nav__lists
                        nav__list
                             nav__link
                             nav__sublists
                             nav__mega-lists
     navbar__logo

====================================================================================================================================================

- Scalabl  and  Modula  Architectur
دسته بندی استایل های پروژه امون به قسمت های کوچک تر که یک وظیفه رو دنبال میکنند

 //  Base    //  body {}  //  h1 {}     //  ul {}  //   Layout     //  .header {}     //  .sidebar {}     //  .content {}       //  .footer {}

  
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

نام گزاری فایل ها در سی اس اس

-  object-oriented css - oocss :   Example BootStrap Utilites =  .btn  .green تبدیل کردن استایل هامون به حالت های کلی و جزعی تر تا هی با کلاس های مختلف بتونیم استایل دهی هارو بکنیم برای مثال

====================================================================================================================================================
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

*/
