/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

-seudo elements : بهت اجازه میدم که آیتم هایی بسازی که در حالت عادی در داکیومنت تری وجود دارد

    1- ::Selection برای تغیر دادن رنگ انتخاب ها     :: placeholder

    2- ::frist-line تغیر برای خط اول  dont span dont inline element
    
    3- ::frist-letter      نکته : این سودو به صورت روت هست  و نمیشه بیایم و به یک تگ یا کلاس خاص بدهیم

    4- ::after::before :  یک موقع هستش که ما نمیخایم بیایم و یک المان یا تگ جدید رو اضافه کنیم و صرفا میخایم به یک تگ امون مثلا در اینجا
       بیایم و به قبل یا بعدش یک محتوایی رو اضافه بکنیم یا یک متن یا یک تصویر یا آیکون رو قرار بدیم برای همین از این ها استفاده میکنیم span یک تگ 
       استفاده میکنیم  content:''  , content:'unicode for fontaswme ' content : ' url(image) '  که حتما در داخل اون ها از 
        
     این سودو المنت رو ندارند  sef-closing   ما از این نوع سودو المنت ها برای همه تگ ها نمیتونیم بیایم و استفاده بکنیم و برای مثال اکثر تگ های 
     اصلا وسط img مثل تگ  sef-closing  دلیلشم اینه که این ویژگی ها باید بیان و بین کانتنت یا اون وسط محتوای تگ بیان و اعمال بشوند و تگ های 

    6- ::focuswhitin :     میاد و میگه به ما که هر یک از المان های داخل اون اگر اومد  و اصطلاحا فوکوس شد بیا و اون تغیراتی
                                که میخای بهت اختصاص بدهیم مثلا  میخایم اینپوت داخلش اگه فوکوس شد بیا و عرض رو افزایش بده 

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
