/*
////////////////////////////////////////////////////////////////////////////////////////////////////////

----------------------------------------------------------------------------------------------------------------------------------------------------------

3-Combinators Selectors
 
1- descendant selector (space)  : ul li 
2- child selector (>) : div > p
3- adjacent sibling selector (+) : div.d + p بلافاصله بیا و تگ  کناریشو انتخاب کن خواهر یا برادرشو
4- general sibling selector (~) : مهم نیست بلافاصله فقط نوع اش رو برامون انتخاب کن
 
----------------------------------------------------------------------------------------------------------------------------------------------------------

4-Atribute Selector

1- Atribute : input[disable]
2- *= $= |= ^= ==> *= مهترین اش هست که همه چی  section[ class*='text' ] 
   *= = 'text' داخل نام کلاس ها هرچی داشت انتخاب شود
   |= اگر نام کلاس مربوطه در اول بود و با - جدا شده بود انتخاب کن
   ^= اگر فقط نام کلاس مورد نظر در اول بود بیا و انتخابشون بکن
   $= مثل یکی بالا فقط از اخر میاد و در نظر میگیرد و نیازی هم به - نیست

----------------------------------------------------------------------------------------------------------------------------------------------------------

////////////////////////////////////////////////////////////////////////////////////////////////////////
 */
