/**
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

background : background-image / background-position / background-size / background-repeat / background-attachment / 
                       background-origin / background-clip / background-color

background-attachment : fix / scroll*   رفتار تصویر پس زمینه را نسبت به اسکرول صفحه و عنصر کنترل می کند

background-size : cover  برای تعیین اندازه تصویر پس زمینه عنصر استفاده می شود و میتواند یک مقدار جفتی به صورت درصدی یا پیکسلی بگیرد که یکی مبنای عرضی پس زمینه
که میاد و کل محتوا رو تا حدی که بتونه cover قرار میدهد این ویژگی علاوه برا مقادیر که گفته شد میتونه دو تا مقدار auto و دومی هم مقدار ارتفاع آن است و اگر یک مقدار بهش بدیم مقدار 
این مقدار باعث می شود تا حداقل یک سمت تصویر برابر با نگهدارنده شود بطوری که کل تصویر قابل مشاهده باشد contain  سطح محیط ترسیم رو بپوشنه و مقدار

Box Model : و ناحیه padding box ناحیه فاصله داخلی یا  content-box هر عنصر از لحاظ مدل قسمت بندی دارای چهار ناحیه است که این نواحی شامل ناحیه محتوا یا اصطلاحا 
margin box  و در نهایت فاصله خارجی یا border-box  حاشیه ها یا
Box Model : Width / Height / Border / Margin / Padding

content-box  : بدیم به عرض و ارتفاع المان امون میاد و اضافه میشه  margin و  padding اصطلاحا به قسمتی که محتوای عنصر امون قرار داره میگویند برای همین اگر این قسمت اوکی باشه بیایم و 

background-origin : هستش شروع ترسیم مارو نشونمون میده فقط روی تصاویر ما padding box این ویژگی تعیین میکند که شروع ترسیم پس زمینه عنصر در کدام ناحیه باشد و مقدار پیش فرض اون
تاثیر  دارد

background-clip :هستش border-box تعیین می کند که پس زمینه عنصر در کدام ناحیه و یا ناحیه ها ترسیم شود کار به نقطه شروع نداره میگه فقط در کدام ناحیه ببینیش و مقدار پیش فرض اش
و در هر قسمتی که خواستیم میاد و فقط برش میزنه و یا اگر زیاد بود میاد و تکرار میزنه برای ما تصویر رو ولی بالایی برش نمیزنه نقطه شروع رو عوض میکنه و هم روی تصاویر و هم رنگ ها تاثیر میگزارد

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Image Sprites : بطور کلی به مجموعه ای از چندین عکس که درون یک تصویر واحد قرار میگیرند یعنی در واقع اینجوری بگیم به چندین تصویر کوچک شده که در کنار همدیگر در یک تصویر واحد قرار
دارند عکس اسپریت شده می گوییم  این تکنیک در کم کردن حجم تصاویر به ما کمک میکنه  و میتونیم چندین تصویر رو باهم دیگه ادغام بکنیم

استفاده کنه یا استفاده کرده باشه، چون الان  دیگه فونت آیکون ها همه جوره جایگزین این روش شدن Image Sprites نکته : الانه دیگه خیلی خیلی کم سایتی هستش که از

.MyIcon {  background-image: url("files/image-sprites.png");     background-repeat: no-repeat;     background-position: -77px 0;        }

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
**/
