/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

flow : صفحه خارج می کنیم, منظور این است که اگر عنصر از این به بعد جابجا شود تکان خوردن آن تاثیری بر دیگر عناصر و مکان آنها نخواهد گذاشت flow  زمانی که گفته می شود عنصری را از
برای مثال  زمانی که عناصر بصورت عادی در زیر هم چیده می شوند اگر عنصر بالایی را حذف کنیم تمام عناصر به سمت بالا جابجا می شوند. و یا اگر عناصری در کنار هم چیده شده باشند اگر عنصری
را از اول لیست حذف کنیم عناصر دیگر جابجا می شوند

viewPort : را جابجا کرد تا بقیه محتوای صفحه قابل نمایش باشند viewport قابی است که می توانید از طریق آن قسمتی از یک سند وب را در لحظه مشاهده کنید, از طریق اسکرول می توان 

position عادی صفحه قرار دارد. زمانی که گفته می شود برای عنصری flow  در صفحه جای گرفته اند. این بدین معنی است که عنصر در جریان یا همان static در حالت پیشفرض تمام عناصر بصورت
position : absoulte / relative / fix   / static* / sticky     تعیین شده است منظور این است که مقدار ویژگی از حالت پیش فرض خودش دیگه خارج شده و به یک مقدار دیگه تغیر کرده است

relative : اگر این مقدار برای یک عنصر تعیین شود دو اتفاق می افتد
          -  هستند را فراهم میکند absolute   عنصر یک سیستم مختصات برای آن دسته از فرزندانش که دارای مقدار
          -  اون رو نسبت به نقطه مبدا یا همان مکان اولیه اشش جابه جا کنیم top و left  یک سیستم مختصات هم برای خودش تعیین می کند که میتونیم با استفاده از 

absoulte : رو داشته  absoulte  relative  fix زمانی که از این حالت برای یک عنصر استفاده می شود, می توان عنصر را نسبت به عنصری از اجدادش جابجا و مکانش را تعیین کرد البته اجدادی که مقادیر
اش خارج کردیم  همچنین دو تا اتفاقی که در بالا میوفته برای این میوفته flow باشند و اگر نداشته میاد و به کل صفحه جابجا میشه با استفاده از این خاصیت ما عنصر رو از حالت
          -  هستند را فراهم میکند absolute   عنصر یک سیستم مختصات برای آن دسته از فرزندانش که دارای مقدار
          -  اون رو نسبت به نقطه مبدا یا همان مکان اولیه اشش جابه جا کنیم top و left  یک سیستم مختصات هم برای خودش تعیین می کند که میتونیم با استفاده از 

fix : میاد و مشخص میکند البته این خاصیت 3 تا حالت استثنا دارد viewPort اش خارج میکنه و مکان اون رو نسبت به flow خیلی شبیه به بالایی عمل میکنه و عنصر رو از حالت 
نسبت به باکس اش میاد و جابه جا میشه viewPort داشته باشه حتی اگر تغیر ظاهری ایجاد نکنه دیگه مقدار فیکس به جای none  به غیر از   transform   اولی یکی از والد هاش مقدار
presPective هستش که مقدار پرنت اش بگیره و مورد آخر هم  filter  دومین استثنا هم 

sticky :  عمل میکند و همیشه میاد و خودش رو همیشه نسبت به اولین اسکرولfix عمل میکند و بعد از اون به صورت relative تا موقعی که میاد و عنصر به نقطه اسکرول برسه به صورت
مکانیزم میاد و خودش رو اسکرول میکنه

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stacking Context : ما یک همچین چیزی رو ایجاد میکنه body  مثل  یک باکس فرضی میمونه که یکسری المان داخل اش قرار میگیرند که به صورت پیش فرض تگ 
به غیر از صفر بدیم  z-index   بدیم   و یامقدار  static  غیر postion  که بیایم و به یک المان امون یک  Stacking Context راه های درست کردن یک 

postion : relative  z-index : 0     //    position : fix
postion : absulote   z-index : 0     //   posion : sticky

رو برامون ایجاد میکنه Stacking Context  هم به صورت پیش فرض یک   dispأlay : flex  المان های فرزند 

opacity : Stacking Context مقدار غیر 1 هم میاد و برامون یک 

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
