/*
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

cookies :  در لغت به معنای شیرینی و در اصل به معنای محل یا جایگاهی برای ذخیره سازی اطلاعات هستش که در یک فایل متنی کوچک در داخل خود سیستم
کاربر میاد و ذخیره می شود و بهتر هستش که بیایم و اطلاعاتی نظیر نام کاربری و ایمیل کاربر رو داخل اون ها ذخیره سازی بکنیم طوری که کاربر دیگه مجبور نباشه
هی بیاد ایمیل و نام کاربری شو مجدد وارد بکنه

نکته : کوکی ها معمولا با بستن مرورگر طول عمرشون تموم میشه ولی ما میتونیم بیایم و برای اون ها طول عمرم تعریف بکنیم

document.cookie = "Cookie_Name = Cookie_Value";    برای تعریف کردن کوکی هامون میتونیم از روش زیر استفاده بکنیم  

function SetCookie ( ){   document.cookie="MySite=Free-Learn"; alert("کوکی با موفقیت ست شد");      }
 
استفاده بکنیم  document.cookie   برای فراخوانی کردن اطلاعاتمون هم فقط کافی هستش که از دستور

function GetCookie ( ) {   var result = document.getElementById("Result")      result.innerHTML = document.cookie             }

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

حال ما برای استفاده از کوکی هامون هم یکسری صفت یا ویژگی داریم که میتونیم از اون ها استفاده بکنیم

expires :	برای مشخص کردن طول عمر کوکی ( با استفاده از تاریخ و ساعت انقضاء )
ocument.cookie = "MyName=Free-Learn;expires=Sun, 23 may 2021 10:25:40 GMT";
        
max-age :	برای مشخص کردن طول عمر کوکی ( با استفاده از زمان بصورت ثانیه )
document.cookie = "MyName=Free-Learn;max-age=10";

path :	دامنه دسترسی به کوکی رو در صفحات سایت مشخص میکنه یعنی این که این کوکی در چه دامنه هایی بیاد و در دسترس ما باشه
document.cookie = "MyName=Free-Learn;max-age=1000;path=/";

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

نحوه ی پاک کردن و حذف کوکی ها 

  1- expires استفاده از تاریخ گذشته در صفت
  2- max-age دادن زمان 0
  3- پاک کردن توسط خود مرورگر

نکته : خواندن و مطالعه ی کد برای گرفتن کوکی هامون به صورت تکی میتونیم بیایم و از توابع زیر استفاده بکنیم که در کد های پایین مشاهده میکنیم

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

HTTP  جهت کاهش درخواست های LocalStorage  از کوکی ها عمدتا جهت اشتراک اطلاعات بین سرور و کامپیوتر کاربر استفاده می شود اما از
بین سرور و کامپیوتر سرور استفاده می شود. همچنین تفاوت بزرگ فنی دیگر میزان ذخیره سازی است
cookie :  4KB   //   LocalStorage  : 5MB

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// ست کردن کوکی

function setCookie( cookie_name, cookie_value , exdays) {
  var mydate ,expires , get_userinput;
  get_userinput = document.getElementById("User_Input").value;
  mydate = new Date();
  mydate.setTime(mydate.getTime() + (exdays*24*60*60*1000));
  expires = "expires="+ mydate.toUTCString();
  document.cookie = cookie_name + "=" + cookie_value + ";" + expires + ";path=/";
  if( get_userinput == "" ){
    alert("بی زحمت یه چیزی وارد کن");
  }else{
    setCookie("UserName", get_userinput , 365);
  }
}
 
// دریافت کوکی از حافظه

function getCookie(cookie_name) {
  var name = cookie_name + "=";
  var decodedCookie = decodeURIComponent(document.cookie);
  var ca = decodedCookie.split(';');
  for(var i = 0; i <ca.length; i++) {
    var c = ca[i];
    while (c.charAt(0) == ' ') {
      c = c.substring(1);
    }
    if (c.indexOf(name) == 0) {
      return c.substring(name.length, c.length);
    }
  }
  return "";
}
 
// چک کردن و گرفتن مقدار کوکی

function checkCookie() {
  var Content_cookie , result;
  result = document.getElementById("Result");
  Content_cookie = getCookie("UserName");
  result.innerHTML = "سلام " + Content_cookie + " خوش برگشتی";
}
 
</script>

 */
