/*
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

localStorage  : یک مکان ذخیره سازی داخل مرورگرمون هستش که به ما امکان ذخیره سازی یک سری اطلاعات رو میده و به صورت دائمی هستش و اگر بیایم و
حتی مرورگرمون رو ببندیم یا تب اشو ببندیم بازم این اطلاعات هستند و پاک نمیشوند 

نکات مهم :

1- حداکثر فضایی که در اختیار ما هستش در این حافظه 5 مگابایت هستش

2- اطلاعاتی که در اون ذخیره میکنیم توسط مرورگر در دسترس هستش پس باید حواسمون باشه که اطلاعات حساس رو داخلش ذخیره نکنیم 

3-  ما ارسال نمی شوند و اگر لازم باشه که به این داده ها در سمت HTTP  اطلاعات هایی که با استفاده از این روش ذخیره سازی میکنیم خود به خود با درخواست های 
سرور دسترسی داشته باشیم باید آن هارو به صورت دستی به سمت سرور ارسال بکنیم

4- بهتر هستش بیایم و موقعی از این ها استفاده کنیم که نیاز داریم یکسری اطلاعات توسط برنامه نویس فرانت در سمت فرانت سایتمون ذخیره بکنیم

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

رو انجام بدهیم CRUD در واقع با استفاده از این فضا میتونیم بیایم و عملیات 

CRUD  :  Create  /  Read / Update / Delete

setItem  : ( "key" , "value" ) : از این متد موقعی میایم و استفاده میکنیم که بخایم بیایم و یکسری اطلاعات رو یا  ثبت کنیم و یا تغیر یا ویرایششون بکنیم   

نکته : ما در داخل لوکال استورج فقط میتونیم بیایم و یک رشته رو ذخیره بکنیم برای همین اگر نیازاون  بود که بیایم و یک آبجکت رو ذخیره کنیم حتما باید بیایم و رو تبدیل به
JSON.stringify ( object ) رشته بکنیم با استفاده از متد های 

getItem(  ' key ' ) : برای گرفتن مقدار یک آیتم که میایم و کلید اون رو صدا میزنیم 

removeItem(  ' key ' ) : برای پاک کردن یک مقدار که میاد و کلید مورد نظر ما رو میگیره

clear () : میاد و همه ی آیتم های موجود مارو پاک میکنه

length  طول و تعداد آیتم هایی که دخیره سازی کردیم رو به ما میدهد

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
