/*
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

sessionStorage  : یک حافظه محدود مثل کوکی ها هستش ولی تنها فرقش اینه که طول عمر نمیشه براش تعریف کرد و تا موقعی که مرورگر هستش در دسترس ما هستش 
و به محض بسته شدن مرورگر هم از بین میرود

sessionStorage.setItem( "Key" , "Value" ); عملیات ست کردن یک سشن

sessionStorage.getItem( "Key" ); برای گرفتن مقدار یک سشن خاص
 
sessionStorage.removeItem("key"); برای حذف یک سشن خاص

sessionStorage.clear(); برای حذف تمامی سشن ها

نمایش داده خواهد شد و این یعنی سشن ست نشده null  وقتی یک سشن تعریف نشده باشد یا کلا ست نشده باشد مقدار 

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/