/**
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

web : سامانه ای اطلاعاتی شامل پرونده های ابر متنی متصل به هم دیگه هستش   

web و Internet  تفاوت های   

1-  سال های تولید اینترنت 1983 بوده ولی وب 1989
2 - هستش HTTP هستش ولی پروتکلی که وب ازش به وجود اومده TCP / IP پروتکلی که اینترنت ازش به وجود اومده پروتکل
3 - وب یکی از زیر مجموعه ها یا کاربرد های اینترنت هستش 

Network Computer   :  به مجموعه از کامپیوتر ها و دستگاه های متصل به هم دیگه 

connection ها یکسری ارتباطات یا Node میگویند که حالا هر کدوم از این  Node نکته : به هر یک از دستگاههای متصل در داخل یک شبکه بهشون 
هایی رو هم باهم دیگه دارند

یا توپولوژی شبکه  Network topology  به تکنیک ها یا روش های اتصال  نود های شبکه به یک هم دیگه میگویند که ما یکسری توپولوژی های 
line       tree      start    Ring     mesh ( حداقل با یک نود در ارتباط باشه )  معروف داریم مثل

Network architecture model   مدل های معماری شبکه ها

1 - client server : یک درخواست و یک ریسپانسو میاد و میگیره و همه چی در مرکزیت یک سرور هستش بزرگ ترین کلاینت های وب مرورگر ها هستند
js css html  که یکسری وظایف دارند مثل ارسال درخواست به سرور و یا رندر کردن صفحات وب و اجرای کد های 

2- peer to peer : ها تشکیل شده که باهم دیگه در ارتباط  peer مدلی که سیستم های بلاک چین و بیت کوین هم دارند شبکه از یکسری نود ها و 
هستند و اگر قرار باشه تصمیمی بگیرند با مشورت باهم دیگه این تصمیم رو میگیرند

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Developer Tools           //         Inspector            ابزار های مرورگرا برای برنامه نویسی ها به

Inspector
1- source     2- Network     3- performance    4- memory    5-Application     6 - security

7- Audit ( سایت مارو چک میکنه وبه صورت کلی و عملکردشو بررسی میکنه و یک نمره رو بهش میده)

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

web Server :   یک نرم افزار هستش که روی سرور سخت افزاری نصب میشه و وظیفه اصلی اش ذخیره سازی و پردازش و پاسخ دادن به درخواست
های کلاینت هست  خوب ما دو تا وب سرور داریم اولی نوع ویندوزی و دومی نوع لینوکسی هستش

CORS = Cross Origin Resource Sharing                سیاست هایی برای این که سرور چه چیز های بپذیرد مسائل امنیتی برای جلوگیری از هک 

مراحل پیدا کردن یک سرور  :  IP   /  DNS  / port server  fttp  cpanel  nginx  http:80   https:443 ssL

AJAX : Refresh                        

FTP Protocol = File Server  = FileZila : 20,21 

How to work DNS ?   DNS Resolver          Root Server            catch browser for DNS 
        
HTTP Status Codes 1xx  2xx  3xx  4xx

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 */
