/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

1-rest Parameter میتونیم بی نهایت  آرگومنت  بیایم و تابع امون بدهیم  برای استفاده از اون باید چند تا نکته رعایت کنیم

- در هنگام کار باید حتما به عنوان آخرین آرگومنت بهش بدیم 
- این مفهوم میاد و تعداد آرگومنت هارو به ما در قالب یک ارایه به ما بر میگردونه
- ما در هر تابع فقط یک بار میتونیم بیام و از این مفهوم یا قابلیت استفاده کنیم 
 
function avrage(...arg) {    let avrage = arg.reduce(function(x, y) {  return x + y;   });  return avrage;    }

console.log(avrage(1,2,3,4,5,6));

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 
2-arguments  :  استفاده میکنیم میتونیم بیایم و از این کلمه استفاده بکنیم  function ما در توابعی که میایم و در تعریف کردنشون از کلمه  کلیدی
و وقتی که استفاده بکنیم میاد و تمام آرگومنت هامون رو  در غالب یک آرایه به ما بر میگردونه و برای استفاده از اون لازم نیست به عنوان آرگومنت به  
تابع بدهیم از این قابلیت در داخل توابع فلش دار نمیتونیم بیایم و استفاده بکنیم

 let Sum = function () {   for (i = 0;    i < arguments.length;  i++  ) {  console.log(arguments[ i] );   }     };

 Sum(12, 8);  // 12  8

let Sum = function () {
    let total = 0;  for (i = 0; i < arguments.length; i++) {  total = total + arguments[i];     }
    return total;  };

console.log(Sum(12, 8));   // 20

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

3- default Parameter  استفاده از پارامتر های پیش فرض برای توابع امون

خوب ما قبلا اگر میخواستیم بیایم و یک مقدار پیش فرض رو تعریف کنیم باید میومدیم و از عملکرد یا استفاده میکردیم

function scale( strudents  , addedValue ,  mark ) {   mark = mark || 18 ;   addValue = addValue ||  1.5
    console.log(students , mark  ,  addedValue)  }
 scale(25,1.5)
  
ولی حالا به شیوه زیر استفاده میکنیم

function scale(strudents  , addedValue ,  mark = 18) { console.log(students , mark  ,  addedValue) }
scale(25,1.5)

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
