/*

option رو مرورگرمون میزنه 

میاد و همیشه به نزدیک ترین آبجکتی که اون رو در بر گرفته اشاره میکنه this

Meta Chaing :  متد هایی که میان و به صورت پشت سر هم اجرا می شوند و لازم نیست که بیایم و یک متغیر اضافه تعریف کنیم همون رو به صورت پشت سر هم قرار بدهیم

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

نام گزاری متغیر ها :  ما معمولا چند شیوه نامگزاری برای متغیر هامون داریم

1- snake_case :  frist_name    //     2- camelCase :  fristName    //     3- PaskalCase :  FristName
   
استفاده بکنیم PaskalCase استفاده بکنیم  همچنین برای محاسبه ثابت هامون بهتر هستش که بیایم و از  camelCase   برای نام گزاری متغیر  هامون بهتر هست که از 

camelCase :  Variables  args    بهتره در ابتدا یک فعل رو قرار بدهیم و بعد یک نام

PaskalCase  :  class  Method  interface   nameSpace   استفاده بکنیم   I  برای نوشتن اینترفیس ها بهتر هستش که اولشون بیایم و از یک 

رو بیاریم is  هستش رو بهتر هست که بیایم و برای  نام گزاری شون در ابتدا کلمه ی  boolean کد هایی که از نوع 

1-     نام گزاری بهتر توابع

*- set تابعی که قراره بیاد و یک مقداری رو ست بکنه برامون         *- get وقتی که تابع امون قراره بیاد و یک مقداری رو بر گردونه 

*- calc وقتی تابع قراره بیاد و یک محاسبه ای رو انجام بده           *- create وقتی تابع امون قراره بیاد و یک چیزی رو بسازه

*- check وقتی تابع ما قراره بیاد و یک چیزی برامون چک کنه       *- show وقتی تابع ما قراره بیاد و یک چیزی برای ما نمایش بده

*-save برای ذخیره کردن
* delete برای پاک کردن یک چیزی
*access  برای دسترسی دادن به یک کار میایم و استفاده بکنیم
*update  برای به روزرسانی استفاده بکنیم

استفاده بکنیم در غیر این صورت وقتی لیست نداریم بهتر هستش بیایم list نکته : برای نامگزاری توابع یا متغیر هایی که از نوع لیست هستند ما مجاز هستیم که بیایم و از کلمه 
استفاده بکنیم  s Group و از صفات جمعی مثل 

استفاده بکنیم و اگر تابع امون به منظرو کاهش این مقدار بود از نام  increment  اگر خواستیم که یک تابعی رو بیایم و بنویسیم که یک مقداری رو افزایش بدهد بهتره که از نام 
استفاده میکنیم decrement 

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

نکته : برای نام گزاری حتما باید بیایم و وقت بزاریم تا خوانایی کدمون بالا بره همچنین نام هایی که انتخاب میکنیم باید نام هایی باشند که قابلیت جست و جو داشته باشند
     
نکته : کلاس ها و اشیاء باید نام های اسمی داشته باشند این که نام یک کلاس فعل باشد این اشتباه هستش این نام متد ها باید فعل یا یک اصطلاح فعلی باشد 
     
نکته : در نامگزاری ها استفاده از نام های فنی هم میتونه گزینه خوبی باشه

Author :  نویسنده   ||       comments ( author  body )        ||  BlogPost    ||   قیمت نهایی   totalPrice   ||     dicCount  تخفیف

atLeastOnePosirive یعنی حداقل یکی مثبت است      ||     introduce  معرفی کردن خود   ||   Generate تولید کننده  GenerateCart   تولید کننده کارت ها     

increase  افزایش دادن از این نام میتونیم بیایم و ترکیبی استفاده کنیم   increaseCounter  ||   handle  برای نامگزاری توابع  handleSubmit  handleMessage ....

showAlert  که میاد و میگوید که بیا و نمایش بده show کلمه کلیدی  ||  payload چیزی که قابل حمله 

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
