/*
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

نکته 1  :
وقتی ما یک سری توابع طولانی و تو در تو داریم میتونیم بیایم  و یکسری کامنت برای محکم کاری یا درک بهتر بزاریم اما بازاولویت با کوتاه کردن و کوچک کردن توابع هستش


نکته 2  :
گاهی اوقات ما وقتی در کدمون مجبور می شیم مثلا یک کدی  رو غیر فعال کنیم یا مثلا کدمون در یک حالت خاص یک ایرادی داره بهتر هستش بیایم و یک کامنت به عنوان  
هشدار برای عواقب کار براش بنویسیم


نکته 3  :
ما بعضی مواقع می توانیم بیایم و یکسری اطلاعات اولیه را تبدیل به یک کامنت کنیم مثل این که مثلا تابع زیر چه چیزی رو برای ما بازگشت می دهد و یا این که بیایمو توضیح
هدف کنیم از خطوط زیر که این کد ها هدفشون چی هستش


نکته 4  :
بهترین کار برای خوانای کد تمیز نوشتن خود کد هستش نوشتن یک کامنت نشونه ضعف اون تیکه کد و فهمش هستش و هربار که یک کامنت می نویسیم باید احساس شکست 
کنیم  همچنین اغلب کامنت ها به خاطر جدایی از کد دچار تغیر و آپدید شدن نمی شن دچار افسردگی میشن و حتی میتونن یک مفهوم اشتباه رو برسونن


نکته 5  :
همچنین اگر قرار بود یک چیزی کلن بیایم FIXME کامنت گزاری اگر یک چیزی میخاستیم بعدا بیایم و درستش کنیم یا بهترش کنیم بهتر هستش که از  کلمه  در اون استفاده بکنیم 
 و تغیرش بدهیم
 

نکته 6  :
بهتر هستش که از  کامنت هایی که جنبه حقوقی یا معرفی نویسنده رو دارند بهتر  هستش که بیام بیرون و در یک فایل قرار بگیرندTODO برای کامنت استفاده بکنیم


نکته 7  :
از نوشتن کامنت های نویز که هیچ اطلاعات جدیدی رو ارائه نمیکنند پرهیز کنید


نکته 8  :
زمانی که می توانید از یک تابع یا یک متغیر استفاده کنید از کامنت استفاده نکنید استفاده از نشانگر های موقعیت یا اصطلاحا کامنت های موقعیت  تنها در مواقعی بیاید و
استفاده کنید که مزایای قابل توجه ای داشته باشند    // Action ////////////////////////////////

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/