/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

FireFox developer for develop 
chorme Canary

Extensetions 
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Material Theme  : Preferences Color Theme
Material Icon Theme
live sass compiler
live server
Auto Rename Tag
Prettier code Formatter
برای فعال سازی اون هم از 
ctrl + shift + P  => document with ...   Prettier

Settings 
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Print Width : 200
tab width : 4
mouse wheel zoom  Tick  for  ctrl  + scroll Mouse 
Suggest Line Height : 24
Line Height : 24
FontFamily : Hack,Iransans
tree indent : 15 تو رفتگی بین آیکون فایل ها و پوشه ها 
line number : off
ctrl + shift + p :   toggle tab
ctrl + shift + p :   toggle Breadcrumbs 
ctrl + shift + p :   toggle StatusBar
ctrl + shift + p :   toggle MiniMap
ctrl + shift + p :   toggle Menu
ctrl + shift + p :   toggle ActivityMenu

shortcut : ctrl +  k +   s

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  
کلید های ترکیبی استفاده میکنیم  ctrl + Tab  برای سوییچ بین فایل های مختلف امون هم میایم و از

go to symbol in editor : ctrl + shift + o 
با استفاده از این میتونیم بیایم و فایل هامون رو یکی یکی پیداشون بکنیم
مثلا کلاس فلان تگ امون بنویسیم تا جای اون رو برامون پیدا بکنه

ctrl shift N : new Vs code
ctrl  + B برای باز و بستن ساید بار استفاده میکنیم
ctrl  + E  جابه جایی بین فایل ها
ctrl + 2   3  :  new Tab
ctrl + w : close Tab 
Alt + Tab : جابه جایی بین پنجره های وی اس کدمون 
ctrl + shift  + k :  برای پاک کردن یک خط میایم و استفاده میکنیم 
ctrl +  X  : برای کات کردن و جا به جایی یک خط
Alt + Up or Down : برای جا به جایی خطوط میایم و استفاده میکنیم
shift  + Alt + UporDown  از این کار هم برای کپی کردن خطوط امون برای سطر های پایینی هستش

نکته : برای انتخاب همه ی گزینه ها یعنی مثلا روی فلان متن اومدیم و سلکت کردیم و حالا 
خواستیم که بقیه اون ها هم بیاد و انتخاب بشه باید بیایم و از کلید های ترکیبی 
ctrl + D  استفاده بکنیم 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/