/*

معماری مرورگرها

                           User Interface
                                
Data persistence     =     Browser Engine 

                           Rendering Engine 
 
          Networking  =  Javascript Interpreter = Ui Backend         

 
User Interface  :   خب این یوزر اینترفیس ها همون اینتراکشن هایی هستن که کاربر با مرورگر داره به عنوان مثال دکمه ی بک ، دکمه ی رفرش ، آدرس بار و

Browser Engine :  موتور هر مرورگر نقش واسطه ای میان موتور رندر و عملیات درخواستی کاربر رو داره  به عبارت دیگه وقتی کاربر روی دکمه ی رفرش کلیک میکنه وظیفه ی
بروزر اینجاین شروع میشه  و این عملیات رو برای موتور رندر قابل فهم میکنه تا عملیات رفرش صورت بگیره

Rendering Engine  : وظیفه ی این قسمت تولید رندر تری و سپس نمایش صفحه هست که در ادامه مفصل در موردش صحبت خواهیم کرد 

Networking : این بخش همونطور که مشخص هست وظیفه ی ارتباط با شبکه و نت ورک  و همچنین فرآیند دی ان اس لوکاپ رو بر عهده داره که باز هم در ادامه در موردش صحبت خواهیم کرد 

Javascript Interpreter این بخش نیز وظیفه ی پارز کردن کدهای جاوا اسکریپت برای مرورگر رو بر عهده داره

Ui Backend دکمه های هر مرورگر در پنجره ی مربوط به خودش در هر سیستم عامل مختلفه و ظاهر متفاوتی داره

Data persistence : بخش هایی مثل کوکی و لوکال استورج ها در این قسمت قرار دارند  


*/
