/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Destructuring : شیوه جدید برای کار کردن با آیتم های یک آرایه یا یک آبجکت هستش و در لغت به معنی شکستن یا خرد کردن هستش این مبحث
هم متعلق به ابجکت ها و هم به آرایه ها و هم خروجی های توابع هستش 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// for Array  بیرون کشیدن یک مقدار یا یک آیتم از آرایه یا شی 

let array = ["emad", "ali", "reza", undefined];          let [a, , c, d = "e"] = array;        console.log(a, c, d);  // emad  reza  e

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// for object   بیرون کشیدن آیتم ها یا مقادیر یک آبجکت 

let obj = {   name1: "emad1",   name2: "emad2",    name3: "emad3",  name4: undefined,  };

let { name1:j , name4 = "eqqq" } = obj;    console.log ( j , name4);
 
// nested destructring 

let obj = {   name1: "emad",  age:25 , adress : "mashhad"  };

const { adress : {city : personCity }}  = obj  console.log(personCity)   //  mashhad

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//for function  بیرون کشیدن مقادیر یک تابع

function increment() { 

    function logger() {   console.log("emad");   }

    function getValue() {   console.log("taghiour");   }

    return { logger, getValue };
};

const { logger, getValue } = increment();

console.log(logger(),getValue());

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
