/*
------------------------------------------------------------------------------------------------------------------------------------------

برای مقایسه بهتر این که ببینیم یک الگوریتم خوب هستش یا بد چند تا بارامتر برای مقایسه کردن اون ها داریم

۱- سرعت که ببنیم سرعت اچرای کدهامون به چه صورت هستش زیاده یا کم

یک نماد کلی هستش که دانشمندان علوم کامبیوتر اون رو تعریف کردن که مدت زمان اجرای یک الگوریتم رو میگه O 

O ( n ) : یعنی الگوریتم ما با یک حلقه بیاد و تک تک عناصر امون رو بیمایش بکنه   

O ( log n ) : یعنی  الگوریم ما بیاد و مثلا از وسط آرایه هامون شروع به بیمایش بکنه یا اینکه بیاد و به صورت دودویی شروع به بیماش بکنه

capsulation : به معنای محصور کردن اطلاعات مرتبط با هم دیگه 
 
------------------------------------------------------------------------------------------------------------------------------------------
*/