/*
--------------------------------------------------------------------------------------------------------------------------------------------------
==================================================================================================================================================

Concept Argoritm :مجموعه از مراحل برای حل یک مسله رو الگوریتم میگویند هربرنامه ای که توسعه داده می شود از یک یا چند الگوریتم
تشکیل شده است هدف اصلی خل مسایل با استفاده از الگوریتم ها است

انتخاب درست یک الگوریتم به منظور ارایه بهترین راه حل برای حل مسله مورد نظر امون هستش

بهترین راه حل مسله

۱- تعداد کد های کمتر که فرایند های پردازشی رو برامون کمتر میکنه و خوانایی کد بهتری رو هم داریم 

۲- بیشتر استفاده از حافظه کمتر Performance  تمرکز اصلی ما روی 


مثال ما  اگر بخایم بیایم و یک الگوریتم بنویسیم برای جمع مقادیر داخل یک آرایه و بخایم میزان پیچیدگی اون رو اندازه بگیریم میتونیم بیایم
و به صورت زیر عمل بکنیم


function addNumbers(number){

      let  result = 0;  // run : 1

      for(const item of numbers){ // run : 1

        result += item  // run : n legth array

      }

      return result // run : 1
}

// T : 1 + 1 + 1 + n  = 3 + n

console.log(addNumbers([2,8,10,5]))


===================================================================================================================================================
---------------------------------------------------------------------------------------------------------------------------------------------------
*/