/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================

درست میکنیم و در داخل theme درست بکنیم و بعد در داخل اون هم یک فایل به نام configs  بیایم و یک پروژه دو تمه بزنیم کافیه بیایم و در مرحله اول یک پوشه به نام  next  اگر خواستیم با استفده از 
اون میایم و می نویسیم

const theme = { colors : { primary : "red" , secoundry : "blue" }        ,   typography : { paragraph : { fontSize : "1em " }   h1 : { fontSize : 30 , lineHeight : 1.15 , fontWeight : 400  } }

spaces : [ "0px" , "2px" , "4px" , "8px" , "16px" , "32px" ]    borderRadius : [ "0px" , "2px" ]    border: [ "0px" , "2px" ]   ,

boderColor : { light : "#e3e334"}  boxShadow : { light : "0 4px  16px rgba(0,0,0,1"  }    }

export default theme

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

import { ThemeProvider } from "emotion-theming"

import theme from "../configs/thme"

const MyApp = ( { Compoent , pageProps } ) => {
    return (
        <ThemeProvider>
            <Compoent  {...pageProps}/>
         </ThemeProvider>
    )
}

--------------------------------------------------------------------------------

و حالا هر کامپوننتی که نیاز داشتیم که بیایم و ازش استفاده بکنیم کافیه که بیایم و از هوک زیر بهش دسترسی پیدا بکنیم

import { useTheme } from "@emotion-themeing"

const theme = useTheme()


====================================================================================================================================================

reset : در اصل میاد و تمام استایل هایی که مرورگر بهمون میده رو پاک میکنه            normalize : همه تغیراتی که بروز میده رو بین بروز های مختلف ثابت میکنه

Global Styling 

import  { Gloval , css , jsx } from "@emotion/core"           const  Reset = () => {  <Global   styles = {css `` /> }
   
export default Reset

  <Reset/>  رو اضافه میکنیم Reset  امون میایم و کامپوننت  _documents  و حالا مثلا در داخل فایل 

====================================================================================================================================================

 پوشه مربوط به فونت هامون رو اضافه میکنیم Public  برای اضافه کردن فونت هامون میایم و اون هارو در داخل یک پوشه با نام 
 در داخل کامپوننت هامون درست بکنیم و بعد بیایم و در اون جا فایل هامون رو قرار بدیم برای  TypoGraphi همچنین برای هندل کردن تایپوگرافی در داخل پروژه امون بهتر هستش که بیایم یک پوشه با نام 
 و در داخل اون می نویسیم H1 مثال یک کامپوننت درست میکنیم با نام 

const H1 = ({ children , align = "right" }) => {
    const theme = useTheme()
    return <h1 css = {css ` text-align : ${ align }   fontWeight : ${theme.typographi.h1.fontWeight   ,   fontSize : ${theme.typographi.h1.fontsize ......... }}` } > { children } </h1> }
export default H1  

https://type-scale.com/   معرفی یک سایت برای بهتر دیدن و تنظیم کردن تایپو گرافی درد داخل پروژه 

 رو هم بیایم و قرار بدیم و استفاده بکنیم space  ما میتونیم برای ایجاد فاصله ها هم بیایم و یک کامپوننت با نام 

 const Space = ( ) => {
    const theme = useTheme()
    return <div css = {css ` width : 100% , height : 1em  }}` } > { children } </div> }
export default Space   


====================================================================================================================================================
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
