/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================
  
Design System      //      یک زبان مشترک بین برنامه نویسی ها  و دیزاینر ها 

Story Books :    https://storybook.js.org/       

npx sb init   اش میشیم React برای استفاده از اون در داخل ری اکت خیلی ساده وارد قسمت 

 از اون استفاده بکنیم stories وخودش میاد و به صورت پیش فرض برامون  کانفیگ هارو انجام میده حالا برای اضافه کردن و استفاده از اون کافیه فقط بیایم و در داخل پوشه ی 

حالا کافیه در هر پوشه امون بیایم و یک فایل هم نام با کامپوننت امون درست بکنیم برای مثال برای 

components /  Button / 

Button.jsx 
Button.stories.js  

import React from "react"

import Button from "./Button"

export default { title : " Button " }

export const primary = ()=> <Button> Primary  </Button>

export const secoundry = () => <Button type = "secoundary" > Secoundy </Button>

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

برای همین  addons  خوب حالا اگر داخل کامپوننت امون اومدیم و از کانتکس استفاده کردیم یختمل برای داک سازی بهمون خطا میده که برای رفع اون بهتر هستش که بیایم و از یک مفهوم استفاده بکنیم به نام 
درست میکنیم و در داخل اون کانتکس هامون رو اضافه میکنیم .preview  میایم و یک فایل به نام 

import   { css , jsx } from "@emotion/core"
import { addDecrator } from "@storybook/react"
import { ThemeProvider } from "emotaion-theming"
import  theme from "../config/theme"

addDecrator ( (storyFn ) )=> ( <ThemeProvider theme= {theme } >
                                                    <div  css= { css ` `  }> {storyFn} </div>
                                                 </ThemeProvider>  )

====================================================================================================================================================

styleguidist  :    https://react-styleguidist.js.org/

بعد از نصب اش امراحل زیر رو انجام میدیم

1- create file styleguide.config.js

2- create file babel.config

3-  قرار دادیم  و md  در نهایت در کنار هر کامپوننتی که میخاستیم بیاید و  داکیومنت بشه یک فایل به صورت

   js
     <Button > Click Here <Button>
   js
     <Button type = "secoundry" > Click Here <Button>

====================================================================================================================================================
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
