/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================

ایجاد میشه و ارسال میشه به سمت کاربرHTML  در این بود که هر موقع کاربر میومد و یک درخواست رو ارسال میکرد به سمت سرور امون همون لحظه اون فایل های  SSR / SSG تفاوت اصلی
بیشتر تفاوت های ان دوتا خود نکس میاد و هندل میکنه برای استفاده از این حالت باید یک تابع رو اضافه بکنیم به نام

استفاده بکنیم SSG نکته : اگر ما از قبل میتونستیم اون صفحه رو ایجاد بکنیم بدون اینکه بیایم و درخواست کاربر رو دریافت بکنیم از حالت 

getServerSideProps :   

export async function getServerSideProps ( { params } ) { 
    const post = await getPost( params.slug )

    if(!post[0]){
        
        return { notFound : true }
    }
}

return {  props : {  post : post [ 0 ] } }


====================================================================================================================================================
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
