/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
====================================================================================================================================================

نحوه ایجاد کردن فایل Json توسط next js

فرض کنید ما یک پیجی داریم شبیه مثال زیر که یکسری موارد رو میاد و برای ما رندرشون میکنه

function  index (props) { }

1 -ما هیچ نیازی به ارسال هیچ props ای رو نداریم و در این حالت خود next این رو برامون هندل میکنه و یک حالت از ssg بهمون نشون میده
در این حالت برامون یک فایل html رو تولید میکنه


 2 -زمانی که از پروژه امون بیلد بگیریم بدون اینکه کاربر اصلا درخواستی رو ارسال کرده باشه ما میتونیم این پراپس هارو ایجاد بکنیم و با استفاده از مند getStaticProps
در این حالت برامون یک فایل html به همراه json درست میکنه در داخل این فایل json در اصل میاد و خروجی props هامون ذخیره میشه 


 3- ما بازم به پراپس نیاز داریم ولی در هنگام بیلد کردن نمیتونیم اون رو داشته باشیم حالا چون تغیر میکنه یا منتظر ارسال درخواست از کاربر داریم برای همین از getServerSideProps استفاده بکنیم
چون در زمان بیلد ما props هارو نداریم اصلا نمیتونیم بیایم و این صفحه رو رندر بکنیم پس در نتیجه هیچ خروجی نداریم

اول از هم یک  request ارسال میشه و این خروجی getServerSideProps سمت سرور اجرا میشه و خروجی اون تحت json دریافت میکنیم و حالا اون اطلاعات props امون دریافت میکنه و صفحه امون
اجرا میشه


====================================================================================================================================================
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
