/*
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
توابع کاربردی ریاضی 
 
1-Math.round   برای رند کردن      
2-Math.pow      برای به توان رساندن که بیایم و از ** استفاده کنیم به جا استفاده از این تابع 
3-Math.sqrt      برای رادیکال گرفتن
4-Math.abs       برای قدرمطلق گرفتن
5-Math.ceil       گرد کردن به سمت بالا
6-Math.floor     گردم کردن به سمت پایین
7- asign :           اگر مقدار ما مثبت باشه میاد و مقدار 1 رو بر میگردونه و اگر منفی باشه عدد -1 و اگر برابر با صفر باشه مقدار 0
8- min & max    بزرگ ترین عدد بین آرگونانت ها


const equalDecimalNumber = (num1,num2)=>{
   return  (Math.abs(num1 - num2) < Number.EPSILON * 10 ) 
}

console.log(equalDecimalNumber(0.3,0.1+0.2))


-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
