/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

sass : میاد تا اون رو به یک زبان برنامه نویسی نزدیک کند css یک پیش پردازنده که به کمک زبان preProcess

اصطلاحا به این پیش پردازنده ها می گویند که یک زبان اسکریپتی  هستند که میان و زبان سی اس اس رو برامون توسعه می دهند

scss   :  have  { }  ;      sass :  havent  { }  ;

معماری  7 - 1   :  ما حدودا 7 تا فولدر داریم که بخش های مختلف یک پروژه امون رو میایم و در بخش های مختلف اون قرار میدهیم

css ریخته و کامپایل میشه style.css امون میاد و در این پوشه  در داخل فایل  sass تمام فایل های 

styleSheets :  رو در داخل این پوشه قرار میدهیم sass  میایم و فایل ها و فولدر های 

        abstract :   _function.scss    //   _mixin.scss   //    _variables.scss  //    _placeholder.scss

        base :  _animations  //  _fonts.scss  //  _helpers.scss //  _typography.scss  // _bace.scss

        component :  _search.scss

        layout :  قسمت های مختلفی که در صفحات مختلف امون داریم و مجدد استفاده میکنیم  _nav.scss  //  _vabar.scss

        pages :  صفحات مختلف پروژه امون   _home.scss

        themes :  پنل ادمین یک تم دیگه  که مثلا محتوا ایناها رو تغیر بده

        venders  :  هم میداد به ما اون فایل ها رو اینجا میزاریم و فایل های لایبری در اینجا میزاریم sass که میومد و به ما فایل های    fontAwsome   مثل   

        main.scss  همه فایل ها در اینجا میاد و اینپورت میشه     @charset "UTF-8" 
          
امون 2 تا فایل html حال با استفاده  از ساختار بالایی که درست کردیم فقط کافی هستش که بیایم و در داخل فایل های  
all.css   //   main.css   رو اضافه کنیم با نام های  css 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
